
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Франчайзи") Тогда
			Если ЗначениеЗаполнено(ДанныеЗаполнения.Франчайзи) ТОгда
				Для Каждого  НоваяЗапись ИЗ ЭтотОбъект Цикл 
					НоваяЗапись.Франчайзи = ДанныеЗаполнения.Франчайзи;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого  НоваяЗапись ИЗ ЭтотОбъект Цикл 
		Если НоваяЗапись.Франчайзи = Справочники.Франчайзи.ПустаяСсылка() Тогда
			Сообщить("Не выбран или не записан элемент справочника Франчайзи!");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
