Функция СформироватьТабличныйДокументС_ШК_ЗСЯ(МассивЗСЯ) Экспорт
	
	ТД = Новый ТабличныйДокумент;
	ТД.ПолеСверху = 0;
	ТД.ПолеСнизу = 0;
	ТД.ПолеСлева = 0;
	ТД.ПолеСправа = 0;
	ТД.РазмерКолонтитулаСверху = 0; 
	ТД.РазмерКолонтитулаСнизу = 0;	
	
	Если ТипЗнч(МассивЗСЯ) <> Тип("Массив") или МассивЗСЯ.Количество() = 0 тогда
		Возврат ТД;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестоЗСЯ.Зона,
	|	МестоЗСЯ.Стеллаж,
	|	МестоЗСЯ.Ячейка,
	|	МестоЗСЯ.ЗонаСсылка
	|ИЗ
	|	Справочник.МестоЗСЯ КАК МестоЗСЯ
	|ГДЕ
	|	МестоЗСЯ.Ссылка В(&МассивЗСЯ)";
	Запрос.УстановитьПараметр("МассивЗСЯ",МассивЗСЯ);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	МакетШК = Обработки.ПечатьШКМестХраненияЗСЯ.ПолучитьМакет("МакетШтрихКода");
	ОбластьШК = МакетШК.ПолучитьОбласть("ШтрихКод");
	
	ПараметрыШтрихКода = Новый Структура;
	ПараметрыШтрихКода.Вставить("Ширина",60);
	ПараметрыШтрихКода.Вставить("Высота",160);
	ПараметрыШтрихКода.Вставить("ОтображатьТекст",Истина);
	ПараметрыШтрихКода.Вставить("УголПоворота",270);
	ПараметрыШтрихКода.Вставить("ОтображатьТекст",Истина);
	ПараметрыШтрихКода.Вставить("ТипКода",1);
	ПараметрыШтрихКода.Вставить("ПрозрачныйФон");	
	
	ТДСтраница = Новый ТабличныйДокумент;

	ТДСтраница.ПолеСверху = 0;
	ТДСтраница.ПолеСнизу = 0;
	ТДСтраница.ПолеСлева = 0;
	ТДСтраница.ПолеСправа = 0;
	ТДСтраница.РазмерКолонтитулаСверху = 0; 
	ТДСтраница.РазмерКолонтитулаСнизу = 0;	

	МассивОбластейПрис = Новый Массив;
	МассивОбластейВывод = Новый Массив;
	Нстр = Истина;
	Для каждого МестоЗСЯ из Таблица цикл
		ПараметрыШтрихКода.Вставить("Штрихкод",справочники.МестоЗСЯ.СформироватьШКМестаЗСЯ(МестоЗСЯ));	
		ОбластьШК.Рисунки.ШК.Картинка = ПечатьСервер.ПолучитьКартинкуШтрихкода(ПараметрыШтрихКода);
		ОбластьШК.Параметры.Зона = МестоЗСЯ.Зона;
		ОбластьШК.Параметры.ст = МестоЗСЯ.Стеллаж;
		ОбластьШК.Параметры.яч = МестоЗСЯ.Ячейка;
		Если Нстр тогда	
			ТД.Вывести(ОбластьШК);
			Нстр = ложь;
			МассивОбластейВывод.Добавить(ОбластьШК);
			МассивОбластейПрис.Добавить(ОбластьШК);
			Продолжить;
		КонецЕсли;	
		
		МассивОбластейПрис.Добавить(ОбластьШК);
		Если не ТДСтраница.ПроверитьПрисоединение(МассивОбластейПрис) тогда
			МассивОбластейПрис.Очистить();
			МассивОбластейПрис.Добавить(ОбластьШК);
			МассивОбластейВывод.Добавить(ОбластьШК);
			Если не ТДСтраница.ПроверитьВывод(МассивОбластейВывод) тогда
				ТД.ВывестиГоризонтальныйРазделительСтраниц();
				МассивОбластейВывод.Очистить();
			КонецЕсли;
			ТД.Вывести(ОбластьШК);
		Иначе
			ТД.Присоединить(ОбластьШК);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТД;
КонецФункции