
&НаСервере
Процедура ВыгрузитьДанныеВУзелНаСервере(Узел,РасшифровкаРезультата)
	
	Результат = ОбменАлгоритмыРИБД.ВыгрузитьДанныеРИБД(Узел,РасшифровкаРезультата);
	
	СообщениеРезультат = Новый СообщениеПользователю;
	СообщениеРезультат.Текст = Узел.Код +" "+РасшифровкаРезультата;
	СообщениеРезультат.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеВУзел(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = неопределено тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ВыбраннаяСтрока из Элементы.Список.ВыделенныеСтроки цикл
		
		//Узел = ТекущиеДанные.Ссылка;	
		Узел = ВыбраннаяСтрока;
		
		РасшифровкаРезультата = "";
		
		ВыгрузитьДанныеВУзелНаСервере(Узел,РасшифровкаРезультата);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПервоначальноеЗаполнениеНаСервере(Узел)
	ОбменАлгоритмыРИБД.ВыполнитьПометкуОбъектовДляПервоначальногоЗаполнения(Узел);
КонецПроцедуры

&НаКлиенте
Процедура ПервоначальноеЗаполнение(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = неопределено тогда
		Возврат;
	КонецЕсли;
	Если КодВозвратаДиалога.Нет = Вопрос("Вы уверенны?",РежимДиалогаВопрос.ДаНет) тогда
		Возврат
	КонецЕсли;
	Если КодВозвратаДиалога.Нет = Вопрос("Вы точно уверенны?",РежимДиалогаВопрос.ДаНет) тогда
		Возврат
	КонецЕсли;	
	Узел = ТекущиеДанные.Ссылка;
	
	ПервоначальноеЗаполнениеНаСервере(Узел);
	РасшифровкаРезультата = "";
	//ВыгрузитьДанныеВУзелНаСервере(Узел,РасшифровкаРезультата)

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийУзел = ПланыОбмена.ПланОбменаДанными.ЭтотУзел(); 
	ОбновитьОчередьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОчередьКоманда(Команда) Экспорт
    ОбновитьОчередьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбновитьОчередьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = ОбменДаннымиПовтИсп.ПолучитьТекстЗапроса_КоличествоОбъектовВОчередиПоУзлуПланаОбмена("ПланОбменаДанными","Таблица.Узел.ОсновнойУзел.ВключитьОбмен",Истина,Истина);
	ДеревоОчереди = РеквизитФормыВЗначение("ТаблицаОчередей",Тип("ДеревоЗначений"));
	ДеревоОчереди.Строки.Очистить();
	ЗначениеВРеквизитФормы(ДеревоОчереди,"ТаблицаОчередей");
	ДеревоОчереди = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбработатьДеревоОчереди(ДеревоОчереди);
	ЗначениеВРеквизитФормы(ДеревоОчереди,"ТаблицаОчередей");
КонецПроцедуры

&НаСервере
Процедура ОбработатьДеревоОчереди(ДеревоОчереди)
	Для каждого СтрокаУзел из ДеревоОчереди.Строки цикл
		Для каждого СтрокаТипМетаданного из СтрокаУзел.Строки цикл
			СтрокаТипМетаданного.Узел = СтрокаТипМетаданного.ТипМетаданного;
			Для каждого СтрокаИмяМетаданного из СтрокаТипМетаданного.Строки цикл
				СтрокаИмяМетаданного.Узел = СтрокаИмяМетаданного.ИмяМетаданного;	
			КонецЦикла;
		КонецЦикла;		
	КонецЦикла;
	ДеревоОчереди.Колонки.Удалить(ДеревоОчереди.Колонки.ТипМетаданного);
	ДеревоОчереди.Колонки.Удалить(ДеревоОчереди.Колонки.ИмяМетаданного);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 ОбновитьОчередьНаСервере();
КонецПроцедуры


&НаСервере
Процедура УдалитьРегистрациюПоМетаданномуНаСервере(Узел,ТипМетаданного,ИмяМетаданного)
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел,Метаданные[ТипМетаданного][ИмяМетаданного]);
КонецПроцедуры


&НаКлиенте
Процедура УдалитьРегистрациюПоМетаданному(Команда)
	Если Вопрос("Вы уверены???",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
		Если Вопрос("Точно???",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда			
			ТекущиеДанные = Элементы.ТаблицаОчередей.ТекущиеДанные;
			Если ТекущиеДанные = Неопределено тогда
				Возврат;
			КонецЕсли;
			ИмяМетаданного = ТекущиеДанные.Узел;
			ТипМетаданного = ТекущиеДанные.ПолучитьРодителя().Узел;
			Узел = ТекущиеДанные.ПолучитьРодителя().ПолучитьРодителя().Узел;
			УдалитьРегистрациюПоМетаданномуНаСервере(Узел,ТипМетаданного,ИмяМетаданного);
			ОбновитьОчередьНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОчередейПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = неопределено тогда
		Элементы.ТаблицаОчередейУдалитьРегистрациюПоМетаданному.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	Родитель =  Элемент.ТекущиеДанные.ПолучитьРодителя();
	Если Родитель = неопределено или Родитель.ПолучитьРодителя() = Неопределено тогда
		Элементы.ТаблицаОчередейУдалитьРегистрациюПоМетаданному.Доступность = Ложь;
	Иначе
		Элементы.ТаблицаОчередейУдалитьРегистрациюПоМетаданному.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

