Процедура ЗаполнитьРегистр() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинхронизируемыеСправочники.Объект,
	|	СинхронизируемыеСправочники.Включить
	|ИЗ
	|	РегистрСведений.СинхронизируемыеСправочники КАК СинхронизируемыеСправочники";
	ТекущиеНастройки = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.СинхронизируемыеСправочники.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Обмен_ОписаниеОбъектов77.Ссылка как Объект,
	|	Обмен_ОписаниеОбъектов77.ИмяМетаданного
	|ИЗ
	|	Справочник.Обмен_ОписаниеОбъектов77 КАК Обмен_ОписаниеОбъектов77
	|ГДЕ
	|	Обмен_ОписаниеОбъектов77.ТипМетаданного = ""Справочник""
	|	И НЕ Обмен_ОписаниеОбъектов77.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		Если Метаданные.Справочники.Найти(Выборка.ИмяМетаданного) <> Неопределено тогда
			Запись = НаборЗаписей.Добавить();	
			Запись.Объект = Выборка.Объект;
			НастройкиДо = ТекущиеНастройки.Найти(Выборка.Объект,"Объект");
			Если НастройкиДо <> неопределено тогда
				Запись.Включить = НастройкиДо.Включить;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры