
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ХранениеЗСЯ.Записывать = Истина;
	Движения.ХранениеЗСЯ.Очистить();
	Движения.МестаЗаказов.Очистить();
	Движения.МестаЗаказов.Записывать = Истина;
	Для каждого строка из Состав цикл
		ДвижениеХЗСЯ = Движения.ХранениеЗСЯ.ДобавитьПриход();
		ДвижениеХЗСЯ.Период = Дата;
		ДвижениеХЗСЯ.Документ = Строка.Заказ;
		ДвижениеХЗСЯ.Склад = Склад;
		ДвижениеХЗСЯ.МестоЗаказа = Строка.МестоЗаказа;
		ДвижениеХЗСЯ.ЗСЯ = Строка.ЗСЯ;
		ДвижениеХЗСЯ.Количество = 1;
		
		ДвижениеМЗ = Движения.МестаЗаказов.ДобавитьРасход();
		ДвижениеМЗ.Период = Дата;
		ДвижениеМЗ.Маршрут = ПолучитьМаршрутЗаказа(Строка.Заказ);
		ДвижениеМЗ.МестоЗаказа = Строка.МестоЗаказа;
		ДвижениеМЗ.Заказ = Строка.Заказ;
		ДвижениеМЗ.Приемка = 1;
		
		
		Менеджер = РегистрыСведений.ПриемкаСамовывозов_РаскаладкаЗаказов.СоздатьМенеджерЗаписи();
		Менеджер.Сотрудник = Сотрудник;
		Менеджер.Маршрут = ДокументОснование;
		Менеджер.Заказ = Строка.Заказ;
		Менеджер.МестоЗаказа = Строка.МестоЗаказа;
		Менеджер.ЗСЯ = Строка.ЗСЯ;
		Менеджер.Удалить();	
	КонецЦикла;
	
	Движения.МестаЗаказов.Записать();
	
	МассивЗаказов = Состав.ВыгрузитьКолонку("Заказ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаЗаказовОстатки.Заказ,
	|	СУММА(МестаЗаказовОстатки.ПриемкаОстаток) КАК ПриемкаОстаток
	|ПОМЕСТИТЬ втНеРазложенныеЗаказы
	|ИЗ
	|	РегистрНакопления.МестаЗаказов.Остатки(&ГраницаВключая, Заказ В (&МассивЗаказов)) КАК МестаЗаказовОстатки
	|ГДЕ
	|	МестаЗаказовОстатки.ПриемкаОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	МестаЗаказовОстатки.Заказ
	|
	|ИМЕЮЩИЕ
	|	СУММА(МестаЗаказовОстатки.ПриемкаОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументЗаказ.Ссылка КАК Заказ
	|ИЗ
	|	Документ.Заказ КАК ДокументЗаказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНеРазложенныеЗаказы КАК втНеРазложенныеЗаказы
	|		ПО втНеРазложенныеЗаказы.Заказ = ДокументЗаказ.Ссылка
	|ГДЕ
	|	ДокументЗаказ.Ссылка В(&МассивЗаказов)
	|	И втНеРазложенныеЗаказы.Заказ ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ГраницаВключая",Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() цикл		
			СтатусыДокументов.УстановитьСтатусСборкиЗаказа(Выборка.Заказ,Ссылка,Справочники.СтатусыОбработкиЗаказа.ЗаказВТочкеСамовывоза,Сотрудник,Дата);		
		КонецЦикла;
	КонецЕсли;;

КонецПроцедуры

Функция ПолучитьМаршрутЗаказа(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутНаАптекуСостав.Ссылка КАК Маршрут
	|ИЗ
	|	Документ.МаршрутНаАптеку.Состав КАК МаршрутНаАптекуСостав
	|ГДЕ
	|	МаршрутНаАптекуСостав.Заказ = &Заказ
	|	И МаршрутНаАптекуСостав.Ссылка.Проведен";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Возврат Выборка.Маршрут;
	КонецЦикла;
	Возврат Документы.МаршрутНаАптеку.ПустаяСсылка();
	
КонецФункции