
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПодчиненныеДокументы.Параметры.УстановитьЗначениеПараметра("ДокументОснование",Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПодчиненныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Док = Элементы.ПодчиненныеДокументы.ТекущиеДанные.Ссылка;
	
	Если ЗначениеЗаполнено(Док) тогда
		ПараметрыФормы = Новый Структура("Ключ",Док);
		Если ТипЗнч(Док) = Тип("ДокументСсылка.Перемещение") тогда
			ОткрытьФорму("Документ.Перемещение.ФормаОбъекта",ПараметрыФормы,ЭтаФорма,Истина);
		ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.Приходная") тогда
			ОткрытьФорму("Документ.Приходная.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма,Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

