
&НаСервере
Процедура ОбновитьНастройкиНаСервере()
	РегистрыСведений.СинхронизируемыеСправочники.ЗаполнитьРегистр();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройки(Команда)
	ОбновитьНастройкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СписокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокПриИзмененииНаСервере()
	
	НаборЗаписей = РеквизитФормыВЗначение("Список",Тип("РегистрСведенийНаборЗаписей.СинхронизируемыеСправочники"));
	НаборЗаписей.Записать();
	
КонецПроцедуры
