
#Область СлужебныеПроцедурыИФункции

Функция ЗагрузитьСправочникТоваров(Контрагент, ДанныеЗагрузки, ИдентификаторыПоставщиков) Экспорт
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("ДанныеЗагрузки", ДанныеЗагрузки);
	ПараметрыЗагрузки.Вставить("ИдентификаторыПоставщиков", ИдентификаторыПоставщиков);
	
	Возврат ОбменДаннымиСКонтрагентами.ЗагрузитьСправочникТоваров(Контрагент, ПараметрыЗагрузки);
	
КонецФункции

Функция ЗагрузитьОстатки(Контрагент, ДанныеЗагрузки) Экспорт
	
	Возврат ОбменДаннымиСКонтрагентами.ЗагрузитьОстатки(Контрагент, ДанныеЗагрузки);
	
КонецФункции

Функция ЗагрузитьЗакупки(Контрагент, ДанныеЗагрузки) Экспорт
	
	Возврат ОбменДаннымиСКонтрагентами.ЗагрузитьЗакупки(Контрагент, ДанныеЗагрузки);
	
КонецФункции

Функция ЗагрузитьПродажи(Контрагент, ДанныеЗагрузки) Экспорт
	
	Возврат ОбменДаннымиСКонтрагентами.ЗагрузитьПродажи(Контрагент, ДанныеЗагрузки);
	
КонецФункции

#КонецОбласти