Функция ПолучитьФонетическийКод(Знач СтрокаИсходная) Экспорт
	
	АлфавитНеисключаемый = "ОЕАИУЭЮЯПСТРКЛМНБВГДЖЗЙФХЦЧШЩЁЫABCDEFGHIGKLMOPQRSTUVWXYZ";
	СогласныеЗвонкие = "БЗДВГЩ";
	СогласныеГлухие =  "ПСТФКШ";
	СогласныеОглушающие = "ПСТКБВГДЖЗФХЦЧШЩ";
	ГласныеИсходные = "ОЮЕИЭЯЁЫ";
	ГласныеЗамена =   "АУУУУАУА";
	                            
	СтрокаРезультат = "";
	СтрокаИсходная = ВРег(СтрокаИсходная);
	Для СтрокаИсходная_НомерСимвола = 1 По СтрДлина(СтрокаИсходная) Цикл
		СтрокаИсходная_Символ = Сред(СтрокаИсходная, СтрокаИсходная_НомерСимвола, 1);
		Если Найти(АлфавитНеисключаемый, СтрокаИсходная_Символ) = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРезультат = СтрокаРезультат + СтрокаИсходная_Символ;
	КонецЦикла;
	СтрокаИсходная = СтрокаРезультат;
	
	Если Не ЗначениеЗаполнено(СтрокаИсходная) Тогда
		Возврат "";
	КонецЕсли;
		
	//СогласныеЗвонкие_НомерСимвола = Найти(СогласныеЗвонкие, Прав(СтрокаИсходная, 1));
	//Если СогласныеЗвонкие_НомерСимвола > 0 Тогда
	//	СтрокаИсходная = Лев(СтрокаИсходная, СтрДлина(СтрокаИсходная) - 1) + Сред(СогласныеГлухие, СогласныеЗвонкие_НомерСимвола, 1);
	//КонецЕсли;
	//
	СтрокаРезультат = "";
	СтрокаИсходная_СимволПредыдущий = "-";
	Для СтрокаИсходная_НомерСимвола = 1 По СтрДлина(СтрокаИсходная) Цикл
		СтрокаИсходная_Символ = Сред(СтрокаИсходная, СтрокаИсходная_НомерСимвола, 1);
		ГласныеИсходные_НомерСимвола = Найти(ГласныеИсходные, СтрокаИсходная_Символ);
		Если ГласныеИсходные_НомерСимвола > 0 Тогда
			//Если ((СтрокаИсходная_СимволПредыдущий = "Й") Или (СтрокаИсходная_СимволПредыдущий = "И"))
			//	И ((СтрокаИсходная_Символ = "О") Или (СтрокаИсходная_Символ = "Е")) Тогда
			//	СтрокаИсходная = Лев(СтрокаИсходная, СтрДлина(СтрокаИсходная) - 1) + "И";
			//Иначе
			Если Сред(ГласныеЗамена, ГласныеИсходные_НомерСимвола, 1)  <> СтрокаИсходная_СимволПредыдущий Тогда
				СтрокаРезультат = СтрокаРезультат + Сред(ГласныеЗамена, ГласныеИсходные_НомерСимвола, 1);
			КонецЕсли;
		Иначе
			Если (СтрокаИсходная_Символ <> СтрокаИсходная_СимволПредыдущий) И (Найти(СогласныеОглушающие, СтрокаИсходная_Символ) > 0) Тогда
				СогласныеЗвонкие_НомерСимвола = Найти(СогласныеЗвонкие, СтрокаИсходная_СимволПредыдущий);
				Если СогласныеЗвонкие_НомерСимвола > 0 Тогда
					СтрокаИсходная_СимволПредыдущий = Сред(СогласныеГлухие, СогласныеЗвонкие_НомерСимвола, 1);
					СтрокаРезультат = Лев(СтрокаРезультат, СтрДлина(СтрокаРезультат) - 1) + СтрокаИсходная_СимволПредыдущий;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаИсходная_Символ <> СтрокаИсходная_СимволПредыдущий Тогда
				СтрокаРезультат = СтрокаРезультат + СтрокаИсходная_Символ;
			КонецЕсли;
		КонецЕсли;
		СтрокаИсходная_СимволПредыдущий = СтрокаИсходная_Символ;
	КонецЦикла;
	
	Возврат СтрокаРезультат;
КонецФункции
