
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивТехническихТиповСборки = Новый Массив;
	МассивТехническихТиповСборки.Добавить(ПредопределенноеЗначение("Перечисление.ТипСборки.СборкаЗаказовИзКоробки"));
	МассивТехническихТиповСборки.Добавить(ПредопределенноеЗначение("Перечисление.ТипСборки.СнятиеРезерваПоОтмененнымЗаказам"));
	Если МассивТехническихТиповСборки.Найти(Объект.ТипСборки) <> неопределено тогда
		Элементы.ТоварыЗаказ.Видимость = Ложь;
		Элементы.ПрогрессСборкиЗаказ.Видимость = Ложь;
		Элементы.Сотрудник.Видимость = Ложь;
		Элементы.СкладПотерь.Видимость = Ложь;
		Элементы.ДокументОснование.Видимость = Ложь;
		Если Объект.ТипСборки = ПредопределенноеЗначение("Перечисление.ТипСборки.СнятиеРезерваПоОтмененнымЗаказам") тогда
			Элементы.ID_77.Видимость = Ложь;
			Элементы.ШК.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ID_77.Видимость = Ложь;
		Элементы.ШК.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Вставить содержимое обработчика.
КонецПроцедуры
