
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Заголовок = Параметры.Заголовок;
	ЭтаФорма.Пояснение = Параметры.Пояснение;
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВвод(Команда)
	
	ТелефонВозр = СтрЗаменить(Телефон,"+7","");
	ТелефонВозр = СтрЗаменить(ТелефонВозр,"(","");	
	ТелефонВозр = СтрЗаменить(ТелефонВозр,")","");
	ТелефонВозр = СокрЛП(СтрЗаменить(ТелефонВозр,"-","")); 
	
	Если СтрДлина(ТелефонВозр) <> 10 тогда
		ПоказатьПредупреждение(,"Не заполнен телефон.",,"Ошибка");
		Возврат;
	КонецЕсли;
	
	Если Лев(ТелефонВозр,3) = "495" или Лев(ТелефонВозр,3) = "499"
		или Лев(ТелефонВозр,3) = "496" или Лев(ТелефонВозр,3) = "812" тогда
		ПоказатьПредупреждение(,"Введен городской телефон, на городской телефон не может быть высланно смс!",,"Ошибка");
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(ТелефонВозр);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
		
	ЭтаФорма.Закрыть(Неопределено);
	
КонецПроцедуры
