
Процедура ПередЗаписью(Отказ)
	
	// если не новый и изменился ВидОбъекта, то нужно перекомпилировать настройки и для старого ВидаОбъекта
	Если Не ЭтоНовый() И Не Отказ
		И ВидОбъекта <> Ссылка.ВидОбъекта Тогда
		СвязиИОтборы_Привилегированный.ПровестиПерекомпиляциюНастроекУсловийОтбораДляВидаОбъекта( Ссылка.ВидОбъекта );
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// при изменении какого-нибудь условия отбора нужно провести перекомпиляцию настроек для данного ВидаОбъекта
	Если Не Отказ Тогда
		СвязиИОтборы_Привилегированный.ПровестиПерекомпиляциюНастроекУсловийОтбораДляВидаОбъекта( ВидОбъекта );
	КонецЕсли;
	
КонецПроцедуры


