
&НаСервере
Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛОЖЬ КАК Обрабатывать,
	|	ПретензииОстатки.Склад,
	|	ПретензииОстатки.Партия,
	|	ПретензииОстатки.Претензия,
	|	ПретензииОстатки.ДокументПретензии,
	|	ПретензииОстатки.СуммаОстаток КАК Сум,
	|	ПретензииОстатки.КоличествоОстаток КАК Кол,
	|	ПретензииОстатки.Партия.Владелец КАК Товар,
	|	ПретензииОстатки.Партия.Серия КАК Серия,
	|	ПретензииОстатки.ДокументПретензии.ДокументОснование.Клиент КАК Поставщик,
	|	ПретензииОстатки.Партия.ЦенаПроизводителя КАК Цена,
	|	ПретензииОстатки.ДокументПретензии.ДокументОснование КАК Накладная,
	|	ПретензииОстатки.ДокументПретензии.Дата КАК ДатаПретензии,
	|	ВЫБОР
	|		КОГДА ПретензииОстатки.ДокументПретензии.ДокументОснование.ОрдернаяСхема = 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоОрдернаяПриемка
	|ИЗ
	|	РегистрНакопления.Претензии.Остатки(
	|			,
	|			ВЫБОР
	|				КОГДА &АдресХранения = ЗНАЧЕНИЕ(Справочник.АдресХранения.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Склад.АдресХранения = &АдресХранения
	|			КОНЕЦ) КАК ПретензииОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПретензии УБЫВ";
	Запрос.УстановитьПараметр("АдресХранения",ПараметрыСеанса.ТекущийАдресХранения);
	
	Объект.Претензии.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	
	Пометка = Истина;
	
	Если Команда.Имя = "СнятьОтметки" тогда
		Пометка = Ложь;	
	КонецЕсли;
	
	Для каждого строка из Объект.Претензии цикл
		Если Элементы.Претензии.ПроверитьСтроку(Строка.ПолучитьИдентификатор()) тогда
			строка.Обрабатывать = Пометка;			
		КонецЕсли;
	КонецЦикла;
	
	ПретензииПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПретензииПриИзменении(Элемент)
	ПретензииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПретензииПриИзмененииНаСервере()
	
	ЗапретНаОбработку = Ложь;
	
	ТЗ = Объект.Претензии.Выгрузить(Новый Структура("Обрабатывать",Истина),"Накладная,Претензия,Поставщик,Склад");
	Если ТЗ.Количество() = 0 тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	МассивНакладных = ТЗ.Скопировать(,"Накладная");
	МассивНакладных.Свернуть("Накладная");
	МассивНакладных = МассивНакладных.ВыгрузитьКолонку("Накладная");
	МассивПретензий = ТЗ.Скопировать(,"Претензия");
	МассивПретензий.Свернуть("Претензия");
	МассивПретензий = МассивПретензий.ВыгрузитьКолонку("Претензия");
	МассивПоставщиков = ТЗ.Скопировать(,"Поставщик");
	МассивПоставщиков.Свернуть("Поставщик");
	МассивПоставщиков = МассивПоставщиков.ВыгрузитьКолонку("Поставщик");
	МассивСкладов = ТЗ.Скопировать(,"Склад");
	МассивСкладов.Свернуть("Склад");
	МассивСкладов = МассивСкладов.ВыгрузитьКолонку("Склад");
	ОдинПоставщик = МассивПоставщиков.Количество() = 1;
	ОдинСклад = МассивСкладов.Количество() = 1;
	ОдинПоставщик = МассивПоставщиков.Количество() = 1;
	ОднаНакладная = МассивНакладных.Количество() = 1;
	ЕстьЛишнийТовар = 0;
	Если (МассивПретензий.Найти(Справочники.Претензии.Недовоз) <> НЕОПРЕДЕЛЕНО
			ИЛИ МассивПретензий.Найти(Справочники.Претензии.Лишний) <> НЕОПРЕДЕЛЕНО) Тогда
		ЕстьЛишнийТовар = 1;
		Если МассивПретензий.Найти(Справочники.Претензии.Брак) <> НЕОПРЕДЕЛЕНО
			ИЛИ МассивПретензий.Найти(Справочники.Претензии.ВозвратПоставщику) <> НЕОПРЕДЕЛЕНО
			ИЛИ МассивПретензий.Найти(Справочники.Претензии.Перевоз) <> НЕОПРЕДЕЛЕНО Тогда
			Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.Доступность = Ложь;  
			Сообщить("Нельзя обрабатывать претензии по лишнему или недовезенному товару совместно с другими претензиями!!!");
			Возврат;
		КонецЕсли;
	Иначе
		ЕстьЛишнийТовар = 3;
	КонецЕсли;
	ТолькоНедовоз = Истина;
	Если МассивПретензий.Количество() >1 или МассивПретензий.Найти(Справочники.Претензии.Недовоз) = неопределено тогда
		ТолькоНедовоз = Ложь;
	КонецЕсли;
	ТолькоЛишний = Истина;
	Если МассивПретензий.Количество() >1 или МассивПретензий.Найти(Справочники.Претензии.Лишний) = неопределено тогда
		ТолькоЛишний = Ложь;
	КонецЕсли;

	Если ЕстьЛишнийТовар = 1 тогда
		ГруппаКСписанию = "Лишний+Недовозы";
		Если ТолькоЛишний тогда
			ГруппаКСписанию = "Лишний";
		ИначеЕсли ТолькоНедовоз и ОдинПоставщик тогда
			ГруппаКСписанию = "Недовозы1";
		ИначеЕсли ТолькоНедовоз и не ОдинПоставщик тогда
			ГруппаКСписанию = "Недовозы0";
		КонецЕсли;
	ИначеЕсли  ОдинПоставщик тогда
		ГруппаКСписанию = "Прочие1";
	Иначе
		ГруппаКСписанию = "Прочие0";
	КонецЕсли;
	
	Если НЕ ОдинСклад и ГруппаКСписанию <> "Недовозы1" тогда
		Сообщить("Выбраны претензии из разных отделов!!!");
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.Доступность = Ложь; 
		Возврат;
	КонецЕсли;
	
	Если Не ОднаНакладная тогда
		Сообщить("Выбраны претензии из разных накладных поставщика!!!");
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.Доступность = Истина;
	Для каждого Кнопка из Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.ПодчиненныеЭлементы цикл
		Кнопка.Доступность = Ложь;
	КонецЦикла;
	
	Если (ГруппаКСписанию = "Лишний") или (ГруппаКСписанию = "Лишний+Недовозы") или (ГруппаКСписанию = "Недовозы0") Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.ПодчиненныеЭлементы.ФормаСписаниеПретензии.Доступность = Истина;
	ИначеЕсли ГруппаКСписанию = "Прочие0" Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.ПодчиненныеЭлементы.ФормаПеремещение.Доступность = Истина;
	Иначе
		Если ГруппаКСписанию = "Недовозы1" Тогда   	
			Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.ПодчиненныеЭлементы.ФормаПриходная.Доступность = Истина;
			Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.ПодчиненныеЭлементы.ФормаСписаниеПретензии.Доступность = Истина;
		Иначе 
			Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.ПодчиненныеЭлементы.ФормаРасходная.Доступность = Истина;
			Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ОбработатьПретензии.ПодчиненныеЭлементы.ФормаПеремещение.Доступность = Истина;
		КонецЕсли;                                              		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	ВидДокумента = Команда.Имя;
	Ссылка = СоздатьДокументНаСервере(ВидДокумента);		
	ОткрытьФорму("Документ."+ВидДокумента+".ФормаОбъекта",Новый Структура("Ключ",Ссылка),ЭтаФорма);
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьДокументНаСервере(ВидДокумента)
	//ОбработкаОбъект = РеквизитФормыВЗначение("Объект",Тип("ОбработкаОбъект.ОбработкаПретензий"));
	Ссылка = Обработки.ОбработкаПретензий.СоздатьДокумент(Объект.Претензии.Выгрузить(Новый Структура("Обрабатывать",Истина)),ВидДокумента);
	Возврат Ссылка
КонецФункции

&НаКлиенте
Процедура Ошибка(Команда)
	
	ОбрабатываемаяСтрока =  Элементы.Претензии.ТекущиеДанные;
	Если ОбрабатываемаяСтрока<> Неопределено тогда
		Если НЕ ОбрабатываемаяСтрока.ЭтоОрдернаяПриемка тогда
			Товар = Строка(ОбрабатываемаяСтрока.Товар);
			ПараметрыОповещения = Новый Структура("ОбрабатываемаяСтрока",ОбрабатываемаяСтрока.ПолучитьИдентификатор());
			Оповещение = Новый ОписаниеОповещения("ОшибкаОповещение",ЭтаФорма,ПараметрыОповещения);
			ПоказатьВопрос(Оповещение,"Вы уверены что хотите вернуть "+СокрЛП(Товар)+" на склад ?",РежимДиалогаВопрос.ДаНет);
		Иначе
			ПоказатьПредупреждение(,"Документ принят по ордерной схеме, изменения невозможны!",10);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОшибкаОповещение(Результат, ПараметрыОповещения) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	Ссылка = ОшибкаОповещениеСервер(ПараметрыОповещения.ОбрабатываемаяСтрока);		
	Если ЗначениеЗаполнено(Ссылка) тогда
		ИмяДокумента = Ссылка.Метаданные().Имя;
		ОткрытьФорму("Документ."+ИмяДокумента+".ФормаОбъекта",Новый Структура("Ключ",Ссылка),ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОшибкаОповещениеСервер(ОбрабатываемаяСтрокаИдентификатор)
	   	ОбрабатываемаяСтрока = Объект.Претензии.НайтиПоИдентификатору(ОбрабатываемаяСтрокаИдентификатор);
		Если ОбрабатываемаяСтрока.Претензия = Справочники.Претензии.Лишний Тогда //Приходную
			ДокПрет = ОбрабатываемаяСтрока.ДокументПретензии.ПолучитьОбъект();
			Для каждого строка из ДокПрет.Товары цикл
				Если строка.Партия=ОбрабатываемаяСтрока.Партия
					И строка.Претензия=ОбрабатываемаяСтрока.Претензия Тогда
					ДокПрет.Товары.Удалить(Строка);
					Прервать;
				КонецЕсли;
			КонецЦикла;      
			ДокПрет.Записать(РежимЗаписиДокумента.Проведение);
			
			Док=ОбрабатываемаяСтрока.Накладная.ПолучитьОбъект();
			Для каждого строка из Док.Товары цикл
				Если строка.Партия=ОбрабатываемаяСтрока.Партия Тогда
					строка.Лишний=0;
					Прервать;
				КонецЕсли;
			КонецЦикла;      
			Док.Записать(РежимЗаписиДокумента.Запись);
		//	Документы.Приходная.СоздатьПретензии(Док.Ссылка)
            
			
			Док = Документы.Приходная.СоздатьДокумент();
			Док.ТипНакладной = Перечисления.ТипыПрихНакл.Закупка;  
			Док.Отдел = ПараметрыСеанса.ОсновнойСклад; 
			Док.Клиент = Справочники.Контрагенты.Склад;
			Док.НомерОснования = "Лиш/"+ОбрабатываемаяСтрока.Накладная.НомерОснования;
			Док.ДатаОснования = ОбрабатываемаяСтрока.Накладная.ДатаОснования;
			Док.ДатаЗаказа = ТекущаяДата();
			Док.БезЗаказа = 1;   
			//Док.ВведенАвтоматическиПоПретензии = 1;   
			Док.ДокументОснование=ОбрабатываемаяСтрока.Накладная;
			Док.Упрощенка=Док.Клиент.Упрощенка;   
				
			СтрокаТовара = Док.Товары.Добавить();
			СтрокаТовара.Товар = ОбрабатываемаяСтрока.Товар;
			СтрокаТовара.Цена = ОбрабатываемаяСтрока.Партия.ЗакупочнаяЦена;
			СтрокаТовара.Количество = ОбрабатываемаяСтрока.Количество;
			СтрокаТовара.Сумма = СтрокаТовара.Цена*СтрокаТовара.Количество;
			СтрокаТовара.ЦенаПроизводителя = ОбрабатываемаяСтрока.Партия.ЦенаПроизводителя; 
			//СтавкаНДС = СтавкаНДСПартииЧисло(ОбрабатываемаяСтрока.Партия,ТекущаяДата(),0);
			//СтрокаТовара.СуммаНДС = СтрокаТовара.Сумма*СтавкаНДС/(100+СтавкаНДС);
			СтрокаТовара.РеестроваяЦена = ОбрабатываемаяСтрока.Партия.РеестроваяЦена; 
			СтрокаТовара.Серия = ОбрабатываемаяСтрока.Партия.Серия;
			СтрокаТовара.ГоденДо = ОбрабатываемаяСтрока.Партия.ГоденДо;
			СтрокаТовара.Сертификат = ОбрабатываемаяСтрока.Партия.Сертификат;
			СтрокаТовара.СертификатДо = ОбрабатываемаяСтрока.Партия.СертификатДо;
			СтрокаТовара.Выдан = ОбрабатываемаяСтрока.Партия.Выдан;       
			СтрокаТовара.СуммаПоставщика=Док.Товары.Итог("Сумма");
            Док.Записать(РежимЗаписиДокумента.Запись);
			Возврат Док.Ссылка;
		ИначеЕсли ОбрабатываемаяСтрока.Претензия = Справочники.Претензии.Недовоз	
			ИЛИ ОбрабатываемаяСтрока.Претензия = Справочники.Претензии.Перевоз 
			ИЛИ ОбрабатываемаяСтрока.Претензия = Справочники.Претензии.Брак Тогда
			ДокПрет = ОбрабатываемаяСтрока.ДокументПретензии.ПолучитьОбъект();
		
			Для каждого строка из ДокПрет.Товары Цикл
				Если (строка.Партия=ОбрабатываемаяСтрока.Партия) И (строка.Претензия=ОбрабатываемаяСтрока.Претензия) Тогда
					ДокПрет.Товары.Удалить(Строка);
					Прервать;
				КонецЕсли;
			КонецЦикла;      
			ДокПрет.Записать(РежимЗаписиДокумента.Запись);
			
			Док = ОбрабатываемаяСтрока.Накладная.ПолучитьОбъект();
			Для каждого строка из Док.Товары Цикл    
				Если строка.Партия=ОбрабатываемаяСтрока.Партия Тогда
					Если ОбрабатываемаяСтрока.Претензия.Код = "0000000001" Тогда
						строка.Недовоз=0;
						Прервать;  
					КонецЕсли;	
					Если ОбрабатываемаяСтрока.Претензия.Код = "0000000002" Тогда
						строка.Перевоз=0;
						Прервать;  
					КонецЕсли;	
					Если ОбрабатываемаяСтрока.Претензия.Код = "0000000003" Тогда
						строка.Брак=0;
						Прервать;  
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;      
			Док.Записать(РежимЗаписиДокумента.Проведение);
           	//	Документы.Приходная.СоздатьПретензии(Док.Ссылка)
		КонецЕсли;
		ОбновитьНаСервере();
	
КонецФункции

&НаСервере
Процедура УдалитьПретензиюОповещениеСервер(ОбрабатываемаяСтрокаИдентификатор)
	
	ОбрабатываемаяСтрока = Объект.Претензии.НайтиПоИдентификатору(ОбрабатываемаяСтрокаИдентификатор);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Претензии.Регистратор КАК Регистратор,
	|	Претензии.НомерСтроки - 1 КАК НомерСтроки,
	|	Претензии.Склад,
	|	Претензии.Партия,
	|	Претензии.Претензия,
	|	Претензии.ДокументПретензии
	|ИЗ
	|	РегистрНакопления.Претензии КАК Претензии
	|ГДЕ
	|	Претензии.Склад = &Склад
	|	И Претензии.Партия = &Партия
	|	И Претензии.Претензия = &Претензия
	|	И Претензии.ДокументПретензии = &ДокументПретензии
	|ИТОГИ ПО
	|	Регистратор";
	Запрос.УстановитьПараметр("Склад", ОбрабатываемаяСтрока.Склад);
	Запрос.УстановитьПараметр("Партия", ОбрабатываемаяСтрока.Партия);
	Запрос.УстановитьПараметр("Претензия", ОбрабатываемаяСтрока.Претензия);
	Запрос.УстановитьПараметр("ДокументПретензии", ОбрабатываемаяСтрока.ДокументПретензии);
	ВыборкаРегистратор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРегистратор.Следующий() цикл
		НаборЗаписей = РегистрыНакопления.Претензии.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = ВыборкаРегистратор.Регистратор;
		НаборЗаписей.Отбор.Регистратор.Использование = Истина;
		НаборЗАписей.Прочитать();
		МассивУдаляемыхСтрок = Новый Массив;
		Выборка = ВыборкаРегистратор.Выбрать();
		Пока Выборка.Следующий() цикл
			МассивУдаляемыхСтрок.Добавить(НаборЗаписей[Выборка.НомерСтроки]);
		КонецЦикла;
		Для каждого УдаляемаСтрока из МассивУдаляемыхСтрок цикл
			НаборЗаписей.Удалить(УдаляемаСтрока);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;      
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПретензиюОповещение(Результат, ПараметрыОповещения) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	УдалитьПретензиюОповещениеСервер(ПараметрыОповещения.ОбрабатываемаяСтрока.ПолучитьИдентификатор());	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Претензия удаленна!";
	Сообщение.Сообщить();
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПретензию(Команда)
	
	ОбрабатываемаяСтрока =  Элементы.Претензии.ТекущиеДанные;
	Если ОбрабатываемаяСтрока<> Неопределено тогда
		Товар = Строка(ОбрабатываемаяСтрока.Товар);
		ПараметрыОповещения = Новый Структура("ОбрабатываемаяСтрока",ОбрабатываемаяСтрока);
		Оповещение = Новый ОписаниеОповещения("УдалитьПретензиюОповещение",ЭтаФорма,ПараметрыОповещения);
		ПоказатьВопрос(Оповещение,"Вы уверены что хотите удалить претензию по товару "+СокрЛП(Товар)+" ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	

КонецПроцедуры
