
Функция DataExchange(Data)
	Возврат ОбменАлгоритмыРИБД.ЗагрузитьДанныеРИБД(Data);
КонецФункции

Функция ConfigExchange(ConfigData)
	Хранилище = ЗначениеИзСтрокиВнутр(ConfigData);
	Возврат ОбменАлгоритмыРИБД.ЗагрузитьИзмененияКонфигурации(Хранилище);
КонецФункции

Функция ExecuteCode(TextCode)
	
	Результат = "";
	РезультатБулево = Ложь;

	Попытка
		Выполнить(TextCode);	
		РезультатБулево = Истина;
	Исключение
		
		мОписаниеОшибки = ОписаниеОшибки();
		Результат = ЗначениеВСтрокуВнутр(мОписаниеОшибки);
		
		РезультатБулево = Ложь;
	КонецПопытки;

		СтруктураОтвета = Новый Структура("Результат, Ошибка");
		СтруктураОтвета.Ошибка		= Не РезультатБулево;
		СтруктураОтвета.Результат	= Результат;
		Результат = ЗначениеВСтрокуВнутр(СтруктураОтвета);

	
	Возврат Результат;
	
КонецФункции


Функция ReciveConfigVersion()
	Если не ОбменАлгоритмыРИБД.ЭтоЦентральнаяБаза() тогда
		ЦентральныйУзел = ПланыОбмена.ГлавныйУзел();
		Если ЗначениеЗаполнено(ЦентральныйУзел) тогда
			Результат = ОбменАлгоритмыРИБД.ВыгрузитьИзмененияКонфигурации(ЦентральныйУзел,Истина);			
			Если СтрНайти(Результат,"Extensions=") = 0 тогда
				НомерСимволаНачалаСтроки = СтрНайти(Результат,"<v8de:Digest2");
				НомерСимволаКонцаСтроки = СтрНайти(Результат,""">",,НомерСимволаНачалаСтроки);
				Если НомерСимволаНачалаСтроки <> 0 и НомерСимволаКонцаСтроки <> 0 тогда
					ПодстрокаПоиска = сред(Результат,НомерСимволаНачалаСтроки,НомерСимволаКонцаСтроки);
					ПодстрокаДляЗамены = ПодстрокаПоиска + " Extensions=""0000000000000000000000000000000000000000""";
					Результат = СтрЗаменить(Результат,ПодстрокаПоиска,ПодстрокаДляЗамены);	
				КонецЕсли;
			КонецЕсли;
			Возврат ЗначениеВСтрокуВнутр(Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9)));
		КонецЕсли;
	КонецЕсли;
	Возврат ЗначениеВСтрокуВнутр(Неопределено);
КонецФункции

