
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПартияИКоличество = Параметры.ПартияИКоличество;
	Серия = ПартияИКоличество.Партия.Серия;
	ГоденДо = ПартияИКоличество.Партия.ГоденДо;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	Попытка
		НачатьТранзакцию();	
		ДокОб = ПартияИКоличество.Документ.ПолучитьОбъект();
		ПартияОб = ПартияИКоличество.Партия.ПолучитьОбъект();
		ПартияОб.Серия = Серия;
		ПартияОб.ГоденДо = ГоденДо;
		ПартияОб.Записать();
		
		СтрокиПартии = ДокОб.Товары.НайтиСтроки(Новый Структура("Партия",ПартияОб.Ссылка));
		Для каждого строка из СтрокиПартии цикл
			Строка.Серия = Серия;
			Строка.ГоденДо = ГоденДо;
		КонецЦикла;
		
		ДокОб.Записать(РежимЗаписиДокумента.Запись);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Записать(Команда)
	Если не (ЗначениеЗаполнено(Серия) и ЗначениеЗаполнено(ГоденДо)) тогда
		ПоказатьПредупреждение(,"Необходимо заполнить серию и срок годности!!!");
	Иначе
		Если ГоденДо < ТекущаяДата() тогда
			ПоказатьПредупреждение(,"Некорректно заполнен срок годности!!!");
			Возврат;
		КонецЕсли;
		Если ЗаписатьНаСервере() тогда
			ЭтаФорма.Закрыть();
			Оповестить("ОрдернаяПриемка_ВыборПартии",ПартияИКоличество,ЭтаФорма.ВладелецФормы);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
