
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	МассивЗаказов = Состав.ВыгрузитьКолонку("Заказ");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаклейкиМестЗаказа.Ссылка,
	|	НаклейкиМестЗаказа.Документ
	|ИЗ
	|	Справочник.НаклейкиМестЗаказа КАК НаклейкиМестЗаказа
	|ГДЕ
	|	НаклейкиМестЗаказа.Документ В(&МассивЗаказов)";
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
	ТаблицаМестЗаказов = Запрос.Выполнить().Выгрузить();
	Движения.МестаЗаказов.Записывать = Истина;
	Движения.МестаЗаказов.Очистить();
	СоставТаблица = Состав.Выгрузить(,"Заказ");
	СоставТаблица.Свернуть("Заказ");	
	МассивДокументов = СоставТаблица.ВыгрузитьКолонку("Заказ");
	Для каждого Заказ из МассивДокументов цикл
		СтрокиМестЗаказов = ТаблицаМестЗаказов.НайтиСтроки(Новый Структура("Документ",Заказ));
		Для каждого строкаМестоЗаказа из СтрокиМестЗаказов цикл
			Движение = Движения.МестаЗаказов.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			Движение.Заказ = Заказ;
			Движение.Маршрут = Ссылка;
			Движение.МестоЗаказа = строкаМестоЗаказа.Ссылка;
			Движение.Приемка = 1;
		КонецЦикла;		
	КонецЦикла;
КонецПроцедуры
