
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") Тогда 
		Поставщик = Параметры.Отбор.Поставщик;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиНастройкиЗаказов(ПараметрыФормы)

	Если ПараметрыФормы.ЭтоНовый Тогда
		
		Возврат РегистрыСведений.НастройкиВыгрузкиЗаказовПоставщикам.ПустойКлюч();
	Иначе
		ДанныеКлюча	= Новый Структура("Поставщик, Договор", ПараметрыФормы.Поставщик, ПараметрыФормы.Договор);
		Возврат РегистрыСведений.НастройкиПрайсовПоставщиков.СоздатьКлючЗаписи(ДанныеКлюча);
	КонецЕсли; 
КонецФункции


&НаКлиенте
Процедура НаборЗаписейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КлючЗаписи = ПолучитьКлючЗаписиНастройкиЗаказов(Новый Структура("Поставщик, Договор, ЭтоНовый", Элементы.НаборЗаписей.ТекущиеДанные.Поставщик, Элементы.НаборЗаписей.ТекущиеДанные.Договор, Ложь));
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
	ОткрытьФорму("РегистрСведений.НастройкиПрайсовПоставщиков.ФормаЗаписи", ПараметрыФормы);
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда

		КлючЗаписи = ПолучитьКлючЗаписиНастройкиЗаказов(Новый Структура("ЭтоНовый", Истина));
		ЗначениеЗаполнения = Новый Структура();
		ЗначениеЗаполнения.Вставить("Поставщик", Элемент.ТекущиеДанные.Поставщик);
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
		ПараметрыФормы.Вставить("ЗначениеЗаполнения", ЗначениеЗаполнения);
		ОткрытьФорму("РегистрСведений.НастройкиПрайсовПоставщиков.ФормаЗаписи", ПараметрыФормы);

	Иначе
		
		текФорма = ПолучитьФорму("РегистрСведений.НастройкиПрайсовПоставщиков.ФормаЗаписи");

	КонецЕсли; 

	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	КлючЗаписи = ПолучитьКлючЗаписиНастройкиЗаказов(Новый Структура("Поставщик, Договор, ЭтоНовый", Элементы.НаборЗаписей.ТекущиеДанные.Поставщик, Элементы.НаборЗаписей.ТекущиеДанные.Договор, Ложь));
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
	ОткрытьФорму("РегистрСведений.НастройкиПрайсовПоставщиков.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры
