
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Претензии.Очистить();
	Движения.Претензии.Записывать = Истина;
	ЗапросПретензии = Новый Запрос;
	ЗапросПретензии.Текст = 
	"ВЫБРАТЬ
	|	СписаниеПретензииТовары.Партия,
	|	СписаниеПретензииТовары.Претензия,
	|	СписаниеПретензииТовары.Ссылка.Отдел
	|ПОМЕСТИТЬ втПретензииБезПустых
	|ИЗ
	|	Документ.СписаниеПретензии.Товары КАК СписаниеПретензииТовары
	|ГДЕ
	|	СписаниеПретензииТовары.Ссылка = &Ссылка
	|	И СписаниеПретензииТовары.Партия <> ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)
	|	И СписаниеПретензииТовары.Претензия <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПретензииОстатки.Склад,
	|	ПретензииОстатки.Партия КАК ПартияПретензии,
	|	ПретензииОстатки.Претензия,
	|	ПретензииОстатки.ДокументПретензии,
	|	ПретензииОстатки.СуммаОстаток КАК Сумма,
	|	ПретензииОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Претензии.Остатки(
	|			&Дата,
	|			(Партия, Претензия, Склад) В
	|				(ВЫБРАТЬ
	|					втПретензииБезПустых.Партия,
	|					втПретензииБезПустых.Претензия,
	|					втПретензииБезПустых.Отдел
	|				ИЗ
	|					втПретензииБезПустых КАК втПретензииБезПустых)) КАК ПретензииОстатки";
	ЗапросПретензии.УстановитьПараметр("Ссылка",Ссылка);
	ЗапросПретензии.УстановитьПараметр("Дата",Новый Граница(МоментВремени(),ВидГраницы.Включая));

	ТЗОстатковПретензий = ЗапросПретензии.Выполнить().Выгрузить();

	Для каждого строка из Товары цикл
		
		ОстаткиПоПартииПретензии = ТЗОстатковПретензий.Скопировать(Новый Структура("ПартияПретензии,Претензия",Строка.Партия,Строка.Претензия));		
		КолП = Строка.Количество;
		Для каждого остаток из ОстаткиПоПартииПретензии цикл
			Кол = остаток.Количество;
			Сум = остаток.Сумма;
			Если Кол = 0 Тогда Продолжить КонецЕсли;
			СписатьКол = Мин(Кол, КолП);   
			Если СписатьКол = Кол Тогда
				СписатьСумму = остаток.Сумма;
			Иначе                                            
				СписатьСумму = СписатьКол*строка.Цена;
			КонецЕсли;
			Движение = Движения.Претензии.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Партия=строка.Партия;
			Движение.Претензия=строка.Претензия;
			Движение.Склад=остаток.Склад;  
			Движение.ДокументПретензии=остаток.ДокументПретензии;
			Движение.Количество=СписатьКол; 
			Движение.Сумма=СписатьСумму;
			Движение.Период = Дата;
			КолП = КолП-СписатьКол;  
			Если КолП=0 Тогда 
				Прервать 
			КонецЕсли;
		КонецЦикла; 

		
	КонецЦикла;
	
КонецПроцедуры
