
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("ОбновитьСтрокуНастройкиЗагрузок");

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)

	Если ПустаяСтрока(Запись.Формат) Тогда
		ПоказатьПредупреждение(, "Не указан формат выгружаемого файла с заказом поставщику", 20);
		Возврат;
	КонецЕсли;
	
	
	Отказ = Истина;
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоляПоУмолчанию", ЭтотОбъект),
    	"Заполнить поля данными по умолчанию?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоляПоУмолчанию(РезультатВопроса, ПараметрыЗаписи) Экспорт

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ВРег(СокрЛП(Запись.Формат)) = "DBF" Тогда

		Запись.Маска = "{number}.dbf";
		Запись.Кодировка = "CP866";
		Запись.Разделитель = "";
		Запись.НомерВыгрузки = 1;
		
		Запись.НомерЗаказа = "NUMZ,N,8,0";
		Запись.ДатаЗаказа = "DATEZ,D";
		Запись.Код = "CODEPST,S,12";
		Запись.Название = "NAME,S,80";
		Запись.Количество = "QNT,N,8,0";
		Запись.Цена = "PRICE,N,9,2";
		Запись.КодГрузополучателя = "PODR,S,12";
		Запись.НазваниеГрузополучателя = "PODRCD,S,40";
		Запись.Дата = "";
		Запись.Клиент = "";
		Запись.POZ = "";
		Запись.PAYID = "";
		Запись.Комметарий = "";
		Запись.Отказ = "";
		Запись.Коробочный = "";
		
	ИначеЕсли ВРег(СокрЛП(Запись.Формат)) = "TXT" Тогда

		Запись.Маска = "order{number}.txt";
		Запись.Кодировка = "Windows-1251";
		Запись.Разделитель = "|";
		Запись.НомерВыгрузки = 1;
		
		Запись.НомерЗаказа = "1";
		Запись.ДатаЗаказа = "";
		Запись.Код = "2";
		Запись.Название = "";
		Запись.Количество = "4";
		Запись.Цена = "3";
		Запись.КодГрузополучателя = "5";
		Запись.НазваниеГрузополучателя = "";
		Запись.Дата = "";
		Запись.Клиент = "";
		Запись.POZ = "";
		Запись.PAYID = "";
		Запись.Комметарий = "";
		Запись.Отказ = "";
		Запись.Коробочный = "";
		
	ИначеЕсли ВРег(СокрЛП(Запись.Формат)) = "ZIPPROTEK" Тогда

		Запись.Маска = "order{number}.xml";
		Запись.Кодировка = "";
		Запись.Разделитель = "";
		Запись.НомерВыгрузки = 1;
		
		Запись.НомерЗаказа = "";
		Запись.ДатаЗаказа = "";
		Запись.Код = "";
		Запись.Название = "";
		Запись.Количество = "";
		Запись.Цена = "";
		Запись.КодГрузополучателя = "";
		Запись.НазваниеГрузополучателя = "";
		Запись.Дата = "";
		Запись.Клиент = "";
		Запись.POZ = "";
		Запись.PAYID = "";
		Запись.Комметарий = "";
		Запись.Отказ = "";
		Запись.Коробочный = "";
		ПоказатьПредупреждение(, "Структура выгружаемого файла строго регламентирована,
			|заполнение наименований полей не обязательно.", 20);

		
	Иначе
		
		ПоказатьПредупреждение(, "Автоматическое заполнение данного формата не предусмотрено.
		|Заполните имена полей самостоятельно.", 20);
		
		Запись.Маска = "*." + НРег(СокрЛП(Запись.Формат));
		Запись.Кодировка = "";
		Запись.Разделитель = "";
		Запись.НачальнаяСтрока = 0;
		
		Запись.Код = "";
		Запись.Название = "";
		Запись.Производитель = "";
		Запись.СтранаПроизводитель = "";
		Запись.Баркод = "";
		Запись.ФормаВыпуска = "";
		Запись.КолВУпаковке = "";
		Запись.КодЕГК = "";
		Запись.Остаток = "";
		Запись.Цена = "";
		Запись.ЦенаРег = "";
		Запись.СтавкаНДС = "";
		Запись.СтавкаНСП = "";
		Запись.СрокГодности = "";
		Запись.Дата = "";
		Запись.ЖВЛ = "";

	КонецЕсли; 

КонецПроцедуры