
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ТабДанных = ПолучитьИзВременногоХранилища(параметры.АдресХранилища_НЕ_Хватило);
	Для каждого СтрокаТЧ Из _ТабДанных Цикл
		СтрокаТЧ1 = фТабНеХватило.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ1, СтрокаТЧ);
	КонецЦикла;

	ВариантОтвета = 2;
	НажалиОК = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)

	НажалиОК = Истина;
	Закрыть(ВариантОтвета);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	//Если НЕ НажалиОК Тогда
	//	ВариантОтвета = 0;
	//КонецЕсли; 

	//Параметры.РезультатЗакрытия = ВариантОтвета;

КонецПроцедуры
