
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.МестаЗаказов.Записывать = Истина;
	Движения.МестаЗаказов.Очистить();
	Для каждого строка из Состав Цикл
		Движение = Движения.МестаЗаказов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Маршрут = ДокументОснование;
		Движение.Заказ = Строка.Заказ;
		Движение.МестоЗаказа = Строка.МестоЗаказа;
		Движение.Приемка = 1;
		
		Движение = Движения.МестаЗаказов.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Маршрут = ДокументОснование;
		Движение.Заказ = Строка.Заказ;
		Движение.МестоЗаказа = Строка.МестоЗаказа;
		Движение.Раскладка= 1;
	КонецЦикла;
	Движения.ОтправкаСМС.Записывать = Истина;
	Движения.ОтправкаСМС.Прочитать();
	Если Движения.ОтправкаСМС.Количество() > 0 тогда
		Возврат;
	КонецЕсли;    
	МассивЗаказов = Новый Массив;
	Для каждого строка из Состав Цикл
		Телефон = СокрЛП(Лев(Строка.Заказ.Телефон,10));
		Если СтрДлина(Телефон) < 10 тогда
			Продолжить;
		КонецЕсли;
		Если Лев(Телефон,3) = "495" или Лев(Телефон,3) = "499"
			или Лев(Телефон,3) = "496" или Лев(Телефон,3) = "812" тогда
			Продолжить;
		КонецЕсли;
		Если МассивЗаказов.Найти(Строка.Заказ) <> неопределено тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ОтправкаСМС.Добавить();
		Движение.Период = Дата;
		Движение.created = Ответственный.Наименование;
		Движение.phone = Телефон;
		//Движение.sms = СокрЛП("Ваш заказ "+СокрЛП(Строка.Заказ.Номер)+" поступил в аптеку "+СокрЛП(Строка.Заказ.ТочкаСамовывоза.Наименование));
		Движение.sms = СокрЛП("Заказ №"+СокрЛП(Строка.Заказ.Номер)+" ожидает в аптеке "+СокрЛП(Строка.Заказ.ТочкаСамовывоза.АдресХранения.Адрес))+". Сумма "+Формат(Строка.Заказ.Товар.Итог("Всего"),"ЧДЦ=2")+" р.";
		Движение.approved = "auto";
		Движение.id_t_tc = СокрЛП(Строка(Строка.Заказ.ТипЦены.Код));
		Движение.iddoc = Строка.Заказ.ID_77;
		Движение.type = 1;
		МассивЗаказов.Добавить(Строка.Заказ);
	КонецЦикла;
КонецПроцедуры
