
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьСтрокуНастройкиЗагрузок");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)

	Если ПустаяСтрока(Запись.Формат) Тогда
		ПоказатьПредупреждение(, "Не указан формат загружаемого прайса поставщика", 20);
		Возврат;
	КонецЕсли;
	
	
	Отказ = Истина;
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоляПоУмолчанию", ЭтотОбъект),
    	"Заполнить поля данными по умолчанию?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоляПоУмолчанию(РезультатВопроса, ПараметрыЗаписи) Экспорт

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ВРег(СокрЛП(Запись.Формат)) = "DBF" Тогда

		Запись.Маска = "*.dbf";
		Запись.Кодировка = "CP866";
		Запись.Разделитель = "";
		Запись.НачальнаяСтрока = 0;
		
		Запись.Код = "CODEPST";
		Запись.Название = "NAME";
		Запись.Производитель = "FIRM";
		Запись.СтранаПроизводитель = "CNTR";
		Запись.Баркод = "EAN13";
		Запись.ФормаВыпуска = "";
		Запись.КолВУпаковке = "QNTPACK";
		Запись.КодЕГК = "";
		Запись.Остаток = "QNT";
		Запись.Цена = "PRICE1";
		Запись.ЦенаРег = "PRICEGR";
		Запись.СтавкаНДС = "NDS";
		Запись.СтавкаНСП = "";
		Запись.СрокГодности = "GDATE";
		Запись.Дата = "";
		Запись.ЖВЛ = "GNVLS";
		
	ИначеЕсли ВРег(СокрЛП(Запись.Формат)) = "TXT" Тогда

		Запись.Маска = "*.txt";
		Запись.Кодировка = "Windows-1251";
		Запись.Разделитель = "|";
		Запись.НачальнаяСтрока = 0;
		
		Запись.Код = "0";
		Запись.Название = "1";
		Запись.Производитель = "2";
		Запись.СтранаПроизводитель = "";
		Запись.Баркод = "9";
		Запись.ФормаВыпуска = "";
		Запись.КолВУпаковке = "6";
		Запись.КодЕГК = "";
		Запись.Остаток = "4";
		Запись.Цена = "3";
		Запись.ЦенаРег = "";
		Запись.СтавкаНДС = "7";
		Запись.СтавкаНСП = "";
		Запись.СрокГодности = "";
		Запись.Дата = "";
		Запись.ЖВЛ = "8";
		
	ИначеЕсли ВРег(СокрЛП(Запись.Формат)) = "ZIPPROTEK" Тогда

		Запись.Маска = "*.zip";
		Запись.Кодировка = "UTF8";
		Запись.Разделитель = "";
		Запись.НачальнаяСтрока = 0;
		
		Запись.Код = "Ид";
		Запись.Название = "Наименование";
		Запись.Производитель = "Изготовитель|ОфициальноеНаименование";
		Запись.СтранаПроизводитель = "";
		Запись.Баркод = "";
		Запись.ФормаВыпуска = "";
		Запись.КолВУпаковке = "ЗначенияСвойств|MIN_QTY_CONTROL";
		Запись.КодЕГК = "ЗначенияСвойств|CD_EGK";
		Запись.Остаток = "Количество";
		Запись.Цена = "Цены|Цена|ЦенаЗаЕдиницу";
		Запись.ЦенаРег = "ЗначенияСвойств|REG_GOS_PRICE";
		Запись.СтавкаНДС = "";
		Запись.СтавкаНСП = "";
		Запись.СрокГодности = "ЗначенияСвойств|EXP_DATE";
		Запись.Дата = "";
		Запись.ЖВЛ = "";
		
	Иначе
		
		ПоказатьПредупреждение(, "Автоматическое заполнение данного формата не предусмотрено.
		|Заполните имена полей самостоятельно.", 20);
		
		Запись.Маска = "*." + НРег(СокрЛП(Запись.Формат));
		Запись.Кодировка = "";
		Запись.Разделитель = "";
		Запись.НачальнаяСтрока = 0;
		
		Запись.Код = "";
		Запись.Название = "";
		Запись.Производитель = "";
		Запись.СтранаПроизводитель = "";
		Запись.Баркод = "";
		Запись.ФормаВыпуска = "";
		Запись.КолВУпаковке = "";
		Запись.КодЕГК = "";
		Запись.Остаток = "";
		Запись.Цена = "";
		Запись.ЦенаРег = "";
		Запись.СтавкаНДС = "";
		Запись.СтавкаНСП = "";
		Запись.СрокГодности = "";
		Запись.Дата = "";
		Запись.ЖВЛ = "";

	КонецЕсли; 

	
КонецПроцедуры