
&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария( Элемент.ТекстРедактирования, ЭтаФорма, "Объект.Комментарий" );
		
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторТипаПриИзменении(Элемент)
	
	Объект.ИдентификаторТипа = СокрЛП( ВРег( Объект.ИдентификаторТипа ) );
	Объект.ИдентификаторТипаУИД = ВычислитьУИДдляИдентификатораТипа( Объект.ИдентификаторТипа );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВычислитьУИДдляИдентификатораТипа( ИдентификаторТипа )
	
	Возврат Справочники.ОписателиТиповИнформационныхБаз.ВычислитьУИДдляИдентификатораТипа( ИдентификаторТипа );
	
КонецФункции