
&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Сохранение );
	ДиалогВыбораФайла.ПолноеИмяФайла = Объект.ИмяФайла;
	
	Если ДиалогВыбораФайла.Выбрать() = Истина Тогда
		
		АдресХранилищаТекущихПравил = ПрочитатьИзХранилищаНаСервере();
		ДвоичныеДанные = ПолучитьИзВременногоХранилища( АдресХранилищаТекущихПравил );
		ДвоичныеДанные.Записать( ДиалогВыбораФайла.ПолноеИмяФайла );
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьИзХранилищаНаСервере()
	
	ДвоичныеДанные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( Объект.Ссылка, "Хранилище" ).Получить();
	
	Возврат ПоместитьВоВременноеХранилище( ДвоичныеДанные );
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьИзФайла(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Открытие );
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ПолноеИмяФайла = Объект.ИмяФайла;
	
	Если ДиалогВыбораФайла.Выбрать() = Истина Тогда
		
		ДвоичныеДанные = Новый ДвоичныеДанные( ДиалогВыбораФайла.ПолноеИмяФайла );
		АдресХранилища = ПоместитьВоВременноеХранилище( ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор );
		
		Объект.ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
		Объект.ДатаЗагрузки = ТекущаяДата();
		
		ЭтаФорма.ПравилаБылаИзменены = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПустаяСтрока( ТекущийОбъект.ИмяФайла ) Тогда
		ОбменДаннымиСервер.СообщитьОбОшибке( "Не загружены правила.", Отказ );
	ИначеЕсли ЭтаФорма.ПравилаБылаИзменены = Истина Тогда
		ТекущийОбъект.Хранилище = Новый ХранилищеЗначения( ПолучитьИзВременногоХранилища( ЭтаФорма.АдресХранилища ), Новый СжатиеДанных(9) );
	КонецЕсли;
	
КонецПроцедуры
