
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого строка из Товары цикл
		Если не ЗначениеЗаполнено(строка.НоваяПартия) и строка.Количество > 0 и строка.НовоеКоличество > 0 тогда
			Строка.НоваяПартия = СоздатьПартиюДеления(Строка.Партия,Строка.Коэффициент,Строка.НовыйТовар);		
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Функция СоздатьПартиюДеления(Партия,Коэффициент,НовыйТовар)
	
	ПартияНовая = Справочники.Партии.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ПартияНовая,Партия,,"Код,Родитель,ID_77");
	ПартияНовая.Владелец = НовыйТовар; 
	ПартияНовая.ЦенаПроизводителя = ПартияНовая.ЦенаПроизводителя/Коэффициент;
	ПартияНовая.РеестроваяЦена = ПартияНовая.РеестроваяЦена/Коэффициент;
	ПартияНовая.ЗакупочнаяЦена = ПартияНовая.ЗакупочнаяЦена/Коэффициент;
	ПартияНовая.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныПартии.Ссылка,
	|	ЦеныПартии.Цена
	|ИЗ
	|	Справочник.ЦеныПартии КАК ЦеныПартии
	|ГДЕ
	|	ЦеныПартии.Владелец = &Партия";
	Запрос.УстановитьПараметр("Партия",Партия);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		ЦенаПартии = справочники.ЦеныПартии.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ЦенаПартии,Выборка.Ссылка,,"Владелец,Родитель,Код,ID_77");
		ЦенаПартии.Владелец = ПартияНовая.Ссылка;
		ЦенаПартии.Цена = Окр(ЦенаПартии.Цена/Коэффициент,0)+1;
		ЦенаПартии.Записать();
	КонецЦикла;
	
	Возврат ПартияНовая.Ссылка;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТовара.Записывать = Истина;
	Движения.ОстаткиТовара.Очистить();
	
	Для Каждого строка из Товары цикл
		ДвижРасх = Движения.ОстаткиТовара.ДобавитьРасход();
		ДвижРасх.Период = Дата;
		ДвижРасх.Регистратор = Ссылка;
		ДвижРасх.Отдел = Отдел;
		ДвижРасх.Товар = Строка.Товар;
		ДвижРасх.Партия = Строка.Партия;
		ДвижРасх.Остаток = Строка.Количество;
		
		ДвижПрих = Движения.ОстаткиТовара.ДобавитьПриход();
		ДвижПрих.Период = Дата;
		ДвижПрих.Регистратор = Ссылка;
		ДвижПрих.Отдел = Отдел;
		ДвижПрих.Товар = Строка.НовыйТовар;
		ДвижПрих.Партия = Строка.НоваяПартия;
		ДвижПрих.Остаток = Строка.НовоеКоличество;		
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТовара.Партия
	|ПОМЕСТИТЬ ВТПартииДвижения
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара КАК ОстаткиТовара
	|ГДЕ
	|	ОстаткиТовара.Регистратор = &ссылка
	|	И ОстаткиТовара.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТовара.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТовараОстатки.Товар,
	|	ОстаткиТовараОстатки.ОстатокОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки(
	|			&ГраницаДок,
	|			Отдел = &Отдел
	|				И Партия В
	|					(ВЫБРАТЬ
	|						ВТПартииДвижения.Партия
	|					ИЗ
	|						ВТПартииДвижения КАК ВТПартииДвижения)) КАК ОстаткиТовараОстатки
	|ГДЕ
	|	ОстаткиТовараОстатки.ОстатокОстаток < 0";
	Запрос.УстановитьПараметр("ГраницаДок", Новый Граница(Дата,ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Отдел", Отдел);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Отказ = Истина;
		Сообщить(Выборка.Товар.КраткоеНаименование + " не хватает " + Формат(-выборка.Остаток,"ЧРГ=; ЧН=0; ЧГ="));
	КонецЦикла;
	
	Если Отказ тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры
