
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбменАлгоритмыРИБД.ЭтоЦентральнаяБаза() тогда
		Элементы.Склад.ТолькоПросмотр = Ложь;
	Иначе
		Объект.Склад = ПараметрыСеанса.ОсновнойСклад;
	КонецЕсли;
	
	ВыбранныеМеста.Параметры.УстановитьЗначениеПараметра("Зона",Справочники.ЗонаХранения.ПустаяСсылка());
	ВыбранныеМеста.Параметры.УстановитьЗначениеПараметра("СтелажС",0);
	ВыбранныеМеста.Параметры.УстановитьЗначениеПараметра("СтелажПо",0);
	ВыбранныеМеста.Параметры.УстановитьЗначениеПараметра("ЯчейкаС",0);
	ВыбранныеМеста.Параметры.УстановитьЗначениеПараметра("ЯчейкаПо",0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЗаполнитьПараметры(Элемент)
	
	Значение = Объект[Элемент.Имя];
	Если ТипЗнч(Значение) = Тип("Число") тогда
		Значение = Строка(Значение);
	КонецЕсли;
	ВыбранныеМеста.Параметры.УстановитьЗначениеПараметра(Элемент.Имя,Значение);
	Элементы.ВыбранныеМеста.Обновить();
	
КонецПроцедуры


&НаСервере
Процедура СформироватьТабДокШКНаСервере(ТД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МестоЗСЯ.Ссылка как МестоЗСЯ
	|ИЗ
	|	Справочник.МестоЗСЯ КАК МестоЗСЯ
	|ГДЕ
	|	МестоЗСЯ.ЗонаСсылка = &Зона
	|	И МестоЗСЯ.Стеллаж МЕЖДУ &СтелажС И &СтелажПо
	|	И МестоЗСЯ.Ячейка МЕЖДУ &ЯчейкаС И &ЯчейкаПо
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗСЯНоменклатуры.МестоЗСЯ
	|ИЗ
	|	РегистрСведений.ЗСЯНоменклатуры КАК ЗСЯНоменклатуры
	|ГДЕ
	|	ЗСЯНоменклатуры.ЗонаСсылка = &Зона
	|	И ЗСЯНоменклатуры.Стеллаж МЕЖДУ &СтелажС И &СтелажПо
	|	И ЗСЯНоменклатуры.Ячейка МЕЖДУ &ЯчейкаС И &ЯчейкаПо";
	Запрос.УстановитьПараметр("Зона",Объект.Зона);
	Запрос.УстановитьПараметр("СтелажС",Строка(Объект.СтелажС));
	Запрос.УстановитьПараметр("СтелажПо",Строка(Объект.СтелажПо));
	Запрос.УстановитьПараметр("ЯчейкаС",Строка(Объект.ЯчейкаС));
	Запрос.УстановитьПараметр("ЯчейкаПо",Строка(Объект.ЯчейкаПо));
	Таблица = Запрос.Выполнить().Выгрузить();
    Если Таблица.Количество() = 0 тогда
		Возврат;
	КонецЕсли;
	
	МассивЗСЯ = Таблица.ВыгрузитьКолонку("МестоЗСЯ");
	
	ТД = Обработки.ПечатьШКМестХраненияЗСЯ.СформироватьТабличныйДокументС_ШК_ЗСЯ(МассивЗСЯ);
	
	//МакетШК = Обработки.ПечатьШКМестХраненияЗСЯ.ПолучитьМакет("МакетШтрихКода");
	//ОбластьШК = МакетШК.ПолучитьОбласть("ШтрихКод");
	//
	//ПараметрыШтрихКода = Новый Структура;
	//ПараметрыШтрихКода.Вставить("Ширина",60);
	//ПараметрыШтрихКода.Вставить("Высота",160);
	//ПараметрыШтрихКода.Вставить("ОтображатьТекст",Истина);
	//ПараметрыШтрихКода.Вставить("УголПоворота",270);
	//ПараметрыШтрихКода.Вставить("ОтображатьТекст",Истина);
	//ПараметрыШтрихКода.Вставить("ТипКода",1);
	//ПараметрыШтрихКода.Вставить("ПрозрачныйФон");	
	//
	//ТДСтраница = Новый ТабличныйДокумент;

	//ТДСтраница.ПолеСверху = 0;
	//ТДСтраница.ПолеСнизу = 0;
	//ТДСтраница.ПолеСлева = 0;
	//ТДСтраница.ПолеСправа = 0;
	//ТДСтраница.РазмерКолонтитулаСверху = 0; 
	//ТДСтраница.РазмерКолонтитулаСнизу = 0;	

	//МассивОбластейПрис = Новый Массив;
	//МассивОбластейВывод = Новый Массив;
	//Нстр = Истина;
	////Для каждого МестоЗСЯ из МассивМестЗСЯ цикл
	//Для каждого МестоЗСЯ из Таблица цикл
	//	ПараметрыШтрихКода.Вставить("Штрихкод",справочники.МестоЗСЯ.СформироватьШКМестаЗСЯ(МестоЗСЯ));	
	//	ОбластьШК.Рисунки.ШК.Картинка = ПечатьСервер.ПолучитьКартинкуШтрихкода(ПараметрыШтрихКода);
	//	ОбластьШК.Параметры.Зона = МестоЗСЯ.Зона;
	//	ОбластьШК.Параметры.ст = МестоЗСЯ.Стеллаж;
	//	ОбластьШК.Параметры.яч = МестоЗСЯ.Ячейка;
	//	Если Нстр тогда	
	//		ТД.Вывести(ОбластьШК);
	//		Нстр = ложь;
	//		МассивОбластейВывод.Добавить(ОбластьШК);
	//		МассивОбластейПрис.Добавить(ОбластьШК);
	//		Продолжить;
	//	КонецЕсли;	
	//	
	//	МассивОбластейПрис.Добавить(ОбластьШК);
	//	Если не ТДСтраница.ПроверитьПрисоединение(МассивОбластейПрис) тогда
	//		МассивОбластейПрис.Очистить();
	//		МассивОбластейПрис.Добавить(ОбластьШК);
	//		МассивОбластейВывод.Добавить(ОбластьШК);
	//		Если не ТДСтраница.ПроверитьВывод(МассивОбластейВывод) тогда
	//			ТД.ВывестиГоризонтальныйРазделительСтраниц();
	//			МассивОбластейВывод.Очистить();
	//		КонецЕсли;
	//		ТД.Вывести(ОбластьШК);
	//	Иначе
	//		ТД.Присоединить(ОбластьШК);	
	//	КонецЕсли;
	//КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШК(Команда)
	ТД = Новый ТабличныйДокумент;
	//ТД.ПолеСверху = 0;
	//ТД.ПолеСнизу = 0;
	//ТД.ПолеСлева = 0;
	//ТД.ПолеСправа = 0;
	//ТД.РазмерКолонтитулаСверху = 0; 
	//ТД.РазмерКолонтитулаСнизу = 0;	
	СформироватьТабДокШКНаСервере(ТД);
	ТД.Показать();
КонецПроцедуры

