Функция ПолучитьЗонуХраненияПоСкладуИНаименованию(Наименование,Склад) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗонаХранения.Ссылка
	|ИЗ
	|	Справочник.ЗонаХранения КАК ЗонаХранения
	|ГДЕ
	|	ЗонаХранения.Наименование = &Наименование
	|	И ЗонаХранения.Склад = &Склад";
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("Склад",Склад);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	Возврат Справочники.ЗонаХранения.ПустаяСсылка();
КонецФункции