
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("НачальныеДанные") Тогда
		ПодобранныеГруппы.Загрузить(Параметры.НачальныеДанные.Выгрузить());
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ЕстьГруппа(слкГруппа)

	Отбор = Новый Структура();
	Отбор.Вставить("ГруппаЗакупки", слкГруппа);
	Строки = ПодобранныеГруппы.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;

КонецФункции // ЕстьГруппа()
 
&НаКлиенте
Процедура ПодобранныеГруппыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокГруппЗакупкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЕстьГруппа(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли; 

	СтрокаТЧ = ПодобранныеГруппы.Добавить();
	СтрокаТЧ.ГруппаЗакупки = ВыбраннаяСтрока;

КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Перенести = Истина;
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СтруктураВозврата = ПриЗакрытииНаСервере();
	
	Если Перенести Тогда
		ОповеститьОВыборе(СтруктураВозврата);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПриЗакрытииНаСервере()
	
	СтруктураВозврата = Новый Структура();
	Если Перенести Тогда
		АдресПодобранногоВХранилище = ПоместитьПодобранноеВХранилище();
		СтруктураВозврата.Вставить("АдресПодобранногоВХранилище", АдресПодобранногоВХранилище);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПоместитьПодобранноеВХранилище()

	ТаблицаПодбора = ПодобранныеГруппы.Выгрузить();
	АдресПодобраннойНоменклатурыВХранилище = ПоместитьВоВременноеХранилище(ТаблицаПодбора, УникальныйИдентификатор);

	Возврат АдресПодобраннойНоменклатурыВХранилище;
	
КонецФункции


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Не Перенести И ПодобранныеГруппы.Количество() > 0 Тогда

		Отказ = Истина;

		ТекстВопроса = НСтр("ru = 'Подобранные группы не перенесены.
			|Перенести?'");
			
		Оповещение = Новый ОписаниеОповещения("ВопросПеренестиЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросПеренестиЗавершение(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		Перенести = Истина;
		Закрыть();
	ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		Перенести = Истина;
		ПодобранныеГруппы.Очистить();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

