&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.ТипПрайса = 0 Тогда
		стрТипПрайса = "Обычный";
	ИначеЕсли Объект.ТипПрайса = 1 Тогда
		стрТипПрайса = "Коробочный";
	Иначе
		стрТипПрайса = "Спец.предложение";
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.стрПодЗаказ.Заголовок = ?(Объект.ПодЗаказ, "Товары под заказ", "");
	Элементы.стрСтатус.Заголовок = ?(Объект.Статус, "Отправлен поставщику", "Создан");

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма =  Макс(0, (ТекущаяСтрока.Количество - ТекущаяСтрока.КоличествоОтказ))* ТекущаяСтрока.Цена;

КонецПроцедуры
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма = Макс(0, (ТекущаяСтрока.Количество - ТекущаяСтрока.КоличествоОтказ)) * ТекущаяСтрока.Цена;

КонецПроцедуры
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	РасчетноеКоличество = Макс(0, (ТекущаяСтрока.Количество - ТекущаяСтрока.КоличествоОтказ));
	Если РасчетноеКоличество = 0  Тогда
		ТекущаяСтрока.Сумма = 0;
		ТекущаяСтрока.Цена = 0;
	Иначе
		Если РасчетноеКоличество = 0 Тогда
			ТекущаяСтрока.Цена = 0;
			ТекущаяСтрока.Сумма = 0;
		Иначе
			ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / РасчетноеКоличество;
			ТекущаяСтрока.Сумма = РасчетноеКоличество * ТекущаяСтрока.Цена;
		КонецЕсли;

	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоОтказПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если ТекущаяСтрока.КоличествоОтказ > ТекущаяСтрока.Количество Тогда
		ТекущаяСтрока.КоличествоОтказ = ТекущаяСтрока.Количество;
	КонецЕсли; 

	ТекущаяСтрока.Сумма =  Макс(0, (ТекущаяСтрока.Количество - ТекущаяСтрока.КоличествоОтказ))* ТекущаяСтрока.Цена;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");

КонецПроцедуры
