
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	АдресХраненияТекущейБазы = Константы.АдресХраненияТекущейБазы.Получить();
	
	ЗапросПретензии = Новый Запрос;
	ЗапросПретензии.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяТовары.Партия,
	|	РасходнаяТовары.Претензия,
	|	РасходнаяТовары.Ссылка.Отдел
	|ПОМЕСТИТЬ втПретензииБезПустых
	|ИЗ
	|	Документ.Расходная.Товары КАК РасходнаяТовары
	|ГДЕ
	|	РасходнаяТовары.Ссылка = &Ссылка
	|	И РасходнаяТовары.Партия <> ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)
	|	И РасходнаяТовары.Претензия <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПретензииОстатки.Склад,
	|	ПретензииОстатки.Партия КАК ПартияПретензии,
	|	ПретензииОстатки.Претензия,
	|	ПретензииОстатки.ДокументПретензии,
	|	ПретензииОстатки.СуммаОстаток КАК Сумма,
	|	ПретензииОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Претензии.Остатки(
	|			&Дата,
	|			(Партия, Претензия, Склад) В
	|				(ВЫБРАТЬ
	|					втПретензииБезПустых.Партия,
	|					втПретензииБезПустых.Претензия,
	|					втПретензииБезПустых.Отдел
	|				ИЗ
	|					втПретензииБезПустых КАК втПретензииБезПустых)) КАК ПретензииОстатки";
	ЗапросПретензии.УстановитьПараметр("Ссылка",Ссылка);
	ЗапросПретензии.УстановитьПараметр("Дата",Новый Граница(МоментВремени(),ВидГраницы.Включая));

	ТЗОстатковПретензий = ЗапросПретензии.Выполнить().Выгрузить();

	
	
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	
	
	Движения.ОстаткиТовара.БлокироватьДляИзменения = Истина;
	Движения.Претензии.Очистить();
	Движения.Претензии.Записывать = Истина;
	Если ТипНакладной=Перечисления.ТипыРасхНакл.Продажа Тогда
		ТипОперации=Перечисления.ТипыОпераций.РеализацияОпт;
	Иначе   
		ТипОперации=Перечисления.ТипыОпераций.ВозвратПоставщику;
	КонецЕсли;

	Для каждого Строка из Товары цикл
		
		ДвижениеОстатки = Движения.ОстаткиТовара.ДобавитьРасход();
		ДвижениеОстатки.Период = Дата;
		ДвижениеОстатки.ТипОперации = ТипОперации;
		ДвижениеОстатки.Товар=Строка.Товар;
		ДвижениеОстатки.Отдел=Отдел;
		ДвижениеОстатки.Партия=Строка.Партия;
		ДвижениеОстатки.Остаток=Строка.Количество;  

		
		Если Отдел = АдресХраненияТекущейБазы.СкладВозвратов или Отдел = АдресХраненияТекущейБазы.СкладПретензий тогда
			ОстаткиПоПартииПретензии = ТЗОстатковПретензий.Скопировать(Новый Структура("ПартияПретензии,Претензия",Строка.Партия,Строка.Претензия));		
			КолП = Строка.Количество;
			Для каждого остаток из ОстаткиПоПартииПретензии цикл
				Кол = остаток.Количество;
				Сум = остаток.Сумма;
				Если Кол = 0 Тогда Продолжить КонецЕсли;
				СписатьКол = Мин(Кол, КолП);   
				СрЦена = Окр(Сум/Кол,2);
				Если СписатьКол = Кол Тогда
					СписатьСумму = остаток.Сумма;
				Иначе                                            
					СписатьСумму = СписатьКол*СрЦена;
				КонецЕсли;
				Движение = Движения.Претензии.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Партия=строка.Партия;
				Движение.Претензия=строка.Претензия;
				Движение.Склад=остаток.Склад;  
				Движение.ДокументПретензии=остаток.ДокументПретензии;
				Движение.Количество=СписатьКол; 
				Движение.Сумма=СписатьСумму;
				Движение.Период = Дата;
				КолП = КолП-СписатьКол;  
				Если КолП=0 Тогда 
					Прервать 
				КонецЕсли;
			КонецЦикла; 

		КонецЕсли;
	
	КонецЦикла;
	
	ЗапросОстатки = Новый Запрос;
	ЗапросОстатки.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяТовары.Ссылка.Отдел,
	|	РасходнаяТовары.Товар,
	|	РасходнаяТовары.Партия
	|ПОМЕСТИТЬ СрезОстатков
	|ИЗ
	|	Документ.Расходная.Товары КАК РасходнаяТовары
	|ГДЕ
	|	РасходнаяТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТовараОстатки.Товар,
	|	ОстаткиТовараОстатки.Отдел,
	|	ОстаткиТовараОстатки.Партия,
	|	ОстаткиТовараОстатки.ОстатокОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки(
	|			&Дата,
	|			(Отдел, Товар, Партия) В
	|				(ВЫБРАТЬ
	|					СрезОстатков.Отдел,
	|					СрезОстатков.Товар,
	|					СрезОстатков.Партия
	|				ИЗ
	|					СрезОстатков КАК СрезОстатков)) КАК ОстаткиТовараОстатки
	|ГДЕ
	|	ОстаткиТовараОстатки.ОстатокОстаток < 0";
	ЗапросОстатки.УстановитьПараметр("Ссылка",Ссылка);
	ЗапросОстатки.УстановитьПараметр("Дата",Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Результат = ЗапросОстатки.Выполнить();
	Если не Результат.Пустой() тогда
		Отказ = Истина;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			 Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст = "Товара """+Выборка.Товар.Наименование+""" нет на складе "+Отдел.Наименование+" в необходимом количестве, нужно ещё "+ (-Выборка.ОстатокОстаток);
   			 Сообщение.Сообщить(); 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
