
Функция ВСтрокеТолькоЦифры(Строка) Экспорт
    RegExp = Новый COMОбъект("VBScript.RegExp");
    RegExp.Pattern =  "^\d+$"; 
    Если RegExp.Test(Строка)=0 Тогда
        Возврат Ложь;
    Иначе
        Возврат Истина;
    КонецЕсли;
КонецФункции


Процедура РасчитатьСтрокуТЗТовары(Строка, РасчетОтСуммы) Экспорт
	
	//Если РасчетОтСуммы тогда
	//	Если Строка.Количество = 0 тогда
	//		Строка.Сумма = 0;
	//		Строка.Цена = 0;
	//	Иначе
	//		Строка.Цена = Окр(Строка.Сумма/Строка.Количество,2);
	//		Если (Строка.Количество-Строка.Недовоз-Строка.Перевоз-Строка.Брак)>0 тогда
	//			Строка.Сумма = Строка.Цена*(Строка.Количество-Строка.Недовоз-Строка.Перевоз-Строка.Брак);
	//		КонецЕсли;
	//	КонецЕсли;
	//Иначе
	//	Строка.Сумма = Строка.Цена*(Строка.Количество-Строка.Недовоз-Строка.Перевоз-Строка.Брак);		
	//КонецЕсли;	
	
	ОбщиеФункцииСервер.РасчитатьСтрокуТЗТоварыСервер(Строка,РасчетОтСуммы);
	
КонецПроцедуры