
Функция ПолучитьКоллекциюМетаданныхПоТипуОбъектаМ( ЗначениеТипа ) Экспорт
	
	Если ЗначениеТипа = Перечисления.ТипыОбъектовМ.Справочник Тогда
		Возврат Метаданные.Справочники;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.Документ Тогда
		Возврат Метаданные.Документы;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.БизнесПроцесс Тогда
		Возврат Метаданные.БизнесПроцессы;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.Задача Тогда
		Возврат Метаданные.Задачи;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.РегистрСведений Тогда
		Возврат Метаданные.РегистрыСведений;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьМенеджерКоллекциПоТипуОбъектаМ( ЗначениеТипа ) Экспорт
	
	Если ЗначениеТипа = Перечисления.ТипыОбъектовМ.Справочник Тогда
		Возврат Справочники;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.Документ Тогда
		Возврат Документы;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.БизнесПроцесс Тогда
		Возврат БизнесПроцессы;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.Задача Тогда
		Возврат Задачи;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.РегистрСведений Тогда
		Возврат РегистрыСведений;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьТипВсеСсылкиКоллекцииМетаданныхПоТипуОбъектаМ( ЗначениеТипа ) Экспорт
	
	Если ЗначениеТипа = Перечисления.ТипыОбъектовМ.РегистрСведений Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МенеджерКоллекции = ПолучитьМенеджерКоллекциПоТипуОбъектаМ( ЗначениеТипа );
	
	Если МенеджерКоллекции <> Неопределено Тогда
		Возврат МенеджерКоллекции.ТипВсеСсылки();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
