

&НаКлиенте
Процедура ВыгрузитьИзмененияКонфигурации(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = неопределено тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ВыбраннаяСтрока из Элементы.Список.ВыделенныеСтроки цикл
		
		//Узел = ТекущиеДанные.Ссылка;
		Узел = ВыбраннаяСтрока;

		
		РасшифровкаРезультата = "";
		
		Результат = ВыгрузитьИзмененияКонфигурацииНаСервере(Узел,РасшифровкаРезультата);
		
		СообщениеРезультат = Новый СообщениеПользователю;
		СообщениеРезультат.Текст = РасшифровкаРезультата;
		СообщениеРезультат.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьИзмененияКонфигурацииНаСервере(Узел,РасшифровкаРезультата)
	
	Возврат ОбменАлгоритмыРИБД.ОбновитьУдаленнуюБазуДанных(Узел,РасшифровкаРезультата);
	                                                             	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийУзел = ПланыОбмена.ПланОбменаОбновлениями.ЭтотУзел();
КонецПроцедуры
