#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДенежныеСредстваККМ Расход
	Движения.ДенежныеСредстваККМ.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваККМ.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.КассаККМ = КассаККМ;
	Движение.Сумма = СуммаДокумента;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	//ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	//
	//ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	//ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

//Процедура ОбработкаУдаленияПроведения(Отказ)
//	
//	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
//	
//	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
//	
//	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
//	
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Процедура СформироватьСписокРегистровДляКонтроля()

//	Массив = Новый Массив;

//	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
//		Массив.Добавить(Движения.ДенежныеСредстваККМ);
//	КонецЕсли;
//	
//	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

//КонецПроцедуры

#КонецОбласти

#КонецЕсли
