
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ЗаполнитьТовары(ВыбранноеЗначение.АдресТоваровВХранилище);
		
		Элементы.Товары.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗаполнитьНоменклатуруИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗагружатьЦены", Истина);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТовары(АдресТоваровВХранилище);
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru='Нет данных для заполнения.'");
	КонецЕсли;
	
	Объект.Товары.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		СтрокаТЧ = Объект.Товары.Добавить();
		СтрокаТЧ.Номенклатура = СтрокаТаблицы.Номенклатура;
		СтрокаТЧ.Цена = СтрокаТаблицы.Цена;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
