
Функция ПолучитьПроцентНаценки(ДиапазонНаценки, Цена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ДиапазоныНаценокДиапазоны.НижняяГраница) КАК НижняяГраница,
	|	ДиапазоныНаценокДиапазоны.Ссылка
	|ПОМЕСТИТЬ МаксимальнаяГраница
	|ИЗ
	|	Справочник.ДиапазоныНаценок.Диапазоны КАК ДиапазоныНаценокДиапазоны
	|ГДЕ
	|	ДиапазоныНаценокДиапазоны.Ссылка = &Ссылка
	|	И ДиапазоныНаценокДиапазоны.НижняяГраница <= &НижняяГраница
	|
	|СГРУППИРОВАТЬ ПО
	|	ДиапазоныНаценокДиапазоны.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДиапазоныНаценокДиапазоны.ПроцентНаценки
	|ИЗ
	|	Справочник.ДиапазоныНаценок.Диапазоны КАК ДиапазоныНаценокДиапазоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальнаяГраница КАК МаксимальнаяГраница
	|		ПО ДиапазоныНаценокДиапазоны.Ссылка = МаксимальнаяГраница.Ссылка
	|			И ДиапазоныНаценокДиапазоны.НижняяГраница = МаксимальнаяГраница.НижняяГраница";
	
	Запрос.УстановитьПараметр("Ссылка", ДиапазонНаценки);
	Запрос.УстановитьПараметр("НижняяГраница", Цена);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].ПроцентНаценки;
	КонецЕсли;	
	
КонецФункции