
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутЗаказы.ДокДоставка КАК Заказ,
	|	МаршрутЗаказы.ДокДоставка.ТочкаСамовывоза.АдресХранения КАК АдресХранения,
	|	МаршрутНаАптеку.Ссылка КАК МаршрутНаАптеку,
	|	МаршрутЗаказы.Ссылка.Номер КАК Номер,
	|	МаршрутЗаказы.Ссылка.Дата КАК Дата,
	|	ЕСТЬNULL(НаклейкиМестЗаказа.Ссылка, ЗНАЧЕНИЕ(Справочник.НаклейкиМестЗаказа.ПустаяСсылка)) КАК МестоЗаказа
	|ИЗ
	|	Документ.Маршрут.Заказы КАК МаршрутЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутНаАптеку КАК МаршрутНаАптеку
	|		ПО МаршрутЗаказы.Ссылка = МаршрутНаАптеку.ДокументОснование
	|			И МаршрутЗаказы.ДокДоставка.ТочкаСамовывоза.АдресХранения = МаршрутНаАптеку.АдресХранения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаклейкиМестЗаказа КАК НаклейкиМестЗаказа
	|		ПО МаршрутЗаказы.ДокДоставка = НаклейкиМестЗаказа.Документ
	|ГДЕ
	|	МаршрутЗаказы.Ссылка = &Ссылка
	|	И МаршрутЗаказы.ДокДоставка <> ЗНАЧЕНИЕ(документ.Заказ.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО,
	|	МаршрутКоробкиСборки.АдресХранения,
	|	МаршрутНаАптеку.Ссылка,
	|	МаршрутКоробкиСборки.Ссылка.Номер,
	|	МаршрутКоробкиСборки.Ссылка.Дата,
	|	NULL
	|ИЗ
	|	Документ.Маршрут.КоробкиСборки КАК МаршрутКоробкиСборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутНаАптеку КАК МаршрутНаАптеку
	|		ПО МаршрутКоробкиСборки.Ссылка = МаршрутНаАптеку.ДокументОснование
	|			И МаршрутКоробкиСборки.АдресХранения = МаршрутНаАптеку.АдресХранения
	|ГДЕ
	|	МаршрутКоробкиСборки.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(МаршрутНаАптеку),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата)
	|ПО
	|	АдресХранения";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ВыборкаАХ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаАХ.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаАХ.МаршрутНаАптеку) тогда
			МаршрутНаАптеку = Документы.МаршрутНаАптеку.СоздатьДокумент();
			МаршрутНаАптеку.ДокументОснование = Ссылка;
			МаршрутНаАптеку.АдресХранения = ВыборкаАХ.АдресХранения;
			МаршрутНаАптеку.Дата = ВыборкаАХ.Дата;
			МаршрутНаАптеку.НомерДокументаОснования = Формат(ВыборкаАХ.Номер,"ЧГ=");
		Иначе
			МаршрутНаАптеку = ВыборкаАХ.МаршрутНаАптеку.ПолучитьОбъект();
		КонецЕсли;
		СоставБыл = МаршрутНаАптеку.Состав.Выгрузить();
		МаршрутНаАптеку.Состав.Очистить();
		Выборка = ВыборкаАХ.Выбрать();
		Пока Выборка.Следующий() цикл
			Если Выборка.Заказ <> неопределено тогда
				НоваяСтрока = МаршрутНаАптеку.Состав.Добавить();
				НоваяСтрока.Заказ = Выборка.Заказ;
				НоваяСтрока.МестоЗаказа = Выборка.МестоЗаказа;
			КонецЕсли;
		КонецЦикла;
		СоставСтал = МаршрутНаАптеку.Состав.Выгрузить(); 
		ЗапросСравнение = Новый Запрос;
		ЗапросСравнение.Текст = 
		"ВЫБРАТЬ
		|	Было.Заказ,
		|	Было.МестоЗаказа
		|ПОМЕСТИТЬ втБыло
		|ИЗ
		|	&Было КАК Было
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Стало.Заказ,
		|	Стало.МестоЗаказа
		|ПОМЕСТИТЬ втСтало
		|ИЗ
		|	&Стало КАК Стало
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втБыло.Заказ,
		|	втБыло.МестоЗаказа,
		|	втСтало.МестоЗаказа КАК МестоЗаказа1,
		|	втСтало.Заказ КАК Заказ1
		|ИЗ
		|	втБыло КАК втБыло
		|		ПОЛНОЕ СОЕДИНЕНИЕ втСтало КАК втСтало
		|		ПО втБыло.Заказ = втСтало.Заказ
		|			И втБыло.МестоЗаказа = втСтало.МестоЗаказа
		|ГДЕ
		|	(втБыло.Заказ ЕСТЬ NULL 
		|			ИЛИ втСтало.Заказ ЕСТЬ NULL )";
		Запрос.УстановитьПараметр("Было",СоставБыл);
		Запрос.УстановитьПараметр("Стало",СоставСтал);
		Если Запрос.Выполнить().Пустой() и не КоробкиСборки.Количество() = 0 тогда
			Продолжить;
		КонецЕсли;
		МаршрутНаАптеку.Состав.Свернуть("Заказ,МестоЗаказа");
		
		МаршрутНаАптеку.КоробкиСборки.Очистить();
		
		СтрокиАХ = КоробкиСборки.НайтиСтроки(Новый Структура("АдресХранения",МаршрутНаАптеку.АдресХранения));
		Для каждого строка из СтрокиАХ цикл
			СтрКор = МаршрутНаАптеку.КоробкиСборки.Добавить();
			СтрКор.Коробка = Строка.Коробка;
		КонецЦикла;
		
		МаршрутНаАптеку.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры
