
// Функция - Получить правила обмена узла
//
// Параметры:
//  УзелИнформационнойБазы	 - ПланОбменаСсылка - ссылка узла, для которого требуется получить правила обмена
// 
// Возвращаемое значение:
//   - СправочникСсылка.ПравилаОбменаДанными, Неопределено - текущие установленные правила обмена для узла
//
Функция ПолучитьПравилаОбменаУзла( УзелИнформационнойБазы ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр( "УзелИнформационнойБазы", УзелИнформационнойБазы );
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилаОбменаДаннымиУзлов.ПравилаОбмена КАК ПравилаОбмена
	|ИЗ
	|	РегистрСведений.ПравилаОбменаДаннымиУзлов КАК ПравилаОбменаДаннымиУзлов
	|ГДЕ
	|	ПравилаОбменаДаннымиУзлов.УзелИнформационнойБазы = &УзелИнформационнойБазы";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПравилаОбмена;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции