
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	ИДККМ = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ККМ").ИдентификаторПользовательскойНастройки;
//	ККМ_Ссылка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИДККМ).Значение;
//	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ЗаводскойНомер").Значение =  ?(ЗначениеЗаполнено(ККМ_Ссылка),"№ " + КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИДККМ).Значение.ЗаводскойНомер,"");
//	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ЗаводскойНомер").Использование = Истина;
//КонецПроцедуры
