Функция СоздатьДокумент(МассивСтрок,ВидДокумента) Экспорт
	НовыйДокумент = Документы[ВидДокумента].СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	РеквизитыДокумента = НовыйДокумент.Метаданные().Реквизиты;
	Если РеквизитыДокумента.Найти("ДокументОснование") <> неопределено тогда
		Для каждого Строка из МассивСтрок цикл
			НовыйДокумент.ДокументОснование = Строка.ДокументПретензии;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидДокумента = "Приходная" тогда
		Для каждого строка из МассивСтрок цикл
			Если ЗначениеЗаполнено(Строка.Накладная) и ТипЗнч(Строка.Накладная) = Тип("ДокументСсылка.Приходная") тогда
				НовыйДокумент.НомерОснования = Строка.Накладная.НомерОснования;
				НовыйДокумент.ДатаОснования = Строка.Накладная.ДатаОснования;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	Если ТипЗнч(НовыйДокумент) = Тип("ДокументОбъект.Приходная") тогда
		ЗаполнитьДокументПриходнаяНакладная(НовыйДокумент, МассивСтрок);
	ИначеЕсли ТипЗнч(НовыйДокумент) = Тип("ДокументОбъект.СписаниеПретензии") тогда
		ЗаполнитьДокументСписаниеПретензии(НовыйДокумент, МассивСтрок);
	ИначеЕсли ТипЗнч(НовыйДокумент) = Тип("ДокументОбъект.Перемещение") тогда
		ЗаполнитьДокументПеремещение(НовыйДокумент, МассивСтрок);
	ИначеЕсли ТипЗнч(НовыйДокумент) = Тип("ДокументОбъект.Расходная") тогда
		ЗаполнитьДокументРасходная(НовыйДокумент, МассивСтрок);
	КонецЕсли;
	
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат НовыйДокумент.Ссылка;
	
		
КонецФункции

Процедура ЗаполнитьДокументПриходнаяНакладная(НовыйДокумент,МассивСтрок)
	НовыйДокумент.ТипНакладной = Перечисления.ТипыПрихНакл.Закупка; 
	Кол = 0; 
	ОтделЗапасов = Константы.АдресХраненияТекущейБазы.Получить().ОсновнойСклад;
	Для каждого строка из МассивСтрок Цикл 
		
		Если Кол = 0 Тогда
			НовыйДокумент.Отдел = ОтделЗапасов; 
			НовыйДокумент.Фирма = строка.Партия.Документ.Фирма;
			НовыйДокумент.Клиент = строка.Поставщик;
			НовыйДокумент.Договор = строка.Накладная.Договор;
			НовыйДокумент.НомерОснования = строка.Накладная.НомерОснования;
			НовыйДокумент.ДатаОснования = строка.Накладная.ДатаОснования;
			НовыйДокумент.ДатаЗаказа = ТекущаяДата();
			НовыйДокумент.БезЗаказа = строка.Накладная.БезЗаказа;   
			НовыйДокумент.ВведенАвтоматическиПоПретензии = Истина;   
			НовыйДокумент.ДокументОснование=строка.Накладная;
			НовыйДокумент.Упрощенка=НовыйДокумент.Клиент.Упрощенка;   
		КонецЕсли; 
		
		Кол = Кол + 1;
		
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Товар = строка.Товар;
		НоваяСтрока.Цена = строка.Партия.ЗакупочнаяЦена;
		НоваяСтрока.Количество = строка.Кол;
		НоваяСтрока.Сумма = НоваяСтрока.Цена*НоваяСтрока.Количество;
		НоваяСтрока.Претензия = строка.Претензия;   
		НоваяСтрока.ПартияПретензии = строка.Партия;
		НоваяСтрока.ЦенаПроизводителя = строка.Партия.ЦенаПроизводителя; 
		//СтавкаНДС = СтавкаНДСПартииЧисло(тз.Партия,ТекущаяДата(),0);
		//НоваяСтрока.СуммаНДС = Док.Сумма*СтавкаНДС/(100+СтавкаНДС);
		НоваяСтрока.РеестроваяЦена = строка.Партия.РеестроваяЦена; 
		
		НоваяСтрока.Серия = строка.Партия.Серия;
		НоваяСтрока.ГоденДо = строка.Партия.ГоденДо;
		НоваяСтрока.Сертификат = строка.Партия.Сертификат;
		НоваяСтрока.СертификатДо = строка.Партия.СертификатДо;
		НоваяСтрока.Выдан = строка.Партия.Выдан;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументСписаниеПретензии(НовыйДокумент,МассивСтрок)
	
	Кол=0;
	Для каждого строка из МассивСтрок Цикл
		  
			Если Кол=0 Тогда
				НовыйДокумент.Отдел = строка.Склад;
			//	НовыйДокумент.Фирма = строка.Партия.Документ.Фирма;
			КонецЕсли;
			Кол=Кол+1;
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Товар = строка.Товар;
			НоваяСтрока.Партия = строка.Партия;
			НоваяСтрока.Цена = строка.Цена;
			НоваяСтрока.Количество = строка.Кол;
			НоваяСтрока.Сумма = строка.Сум;
			НоваяСтрока.Претензия = строка.Претензия;
		
	КонецЦикла;    
	
КонецПроцедуры

Процедура ЗаполнитьДокументПеремещение(НовыйДокумент, МассивСтрок)
	
	НовыйДокумент.Поставщик = МассивСтрок[0].Склад;
	НовыйДокумент.ВведенАвтоматически = Истина;
	НовыйДокумент.Получатель=Константы.АдресХраненияТекущейБазы.Получить().ОсновнойСклад;;

	НовыйДокумент.БезУчетаДефектуры = Истина;
	Для каждого строка из МассивСтрок цикл
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Товар = строка.Товар;
		НоваяСтрока.Партия = строка.Партия;
		НоваяСтрока.Цена = строка.Цена;
		НоваяСтрока.Количество = строка.Кол;
		НоваяСтрока.Сумма = строка.Сум;
		НоваяСтрока.Претензия = строка.Претензия;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументРасходная(НовыйДокумент, МассивСтрок)
	
	НовыйДокумент.ТипНакладной = Перечисления.ТипыРасхНакл.Возврат; 
	Кол = 0;
	Для каждого строка из МассивСтрок Цикл			
		Если Кол = 0 Тогда 
			НовыйДокумент.ВведенАвтоматически = Истина;
			НовыйДокумент.БезУчетаДефектуры = Истина;
			НовыйДокумент.Отдел = строка.Склад; 
			НовыйДокумент.Фирма = строка.Партия.Документ.Фирма;
			НовыйДокумент.Клиент = строка.Поставщик; 
			НовыйДокумент.Договор = строка.Накладная.Договор;  
		КонецЕсли; 
		
		Кол = Кол + 1;
		
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Товар = строка.Товар;
		НоваяСтрока.Партия = строка.Партия;
		НоваяСтрока.Цена = строка.Партия.ЗакупочнаяЦена;
		НоваяСтрока.РозничнаяЦена = 0;
		НоваяСтрока.РозничнаяСумма = 0;
		НоваяСтрока.Количество = строка.кол;
		НоваяСтрока.Сумма = НоваяСтрока.Цена*НоваяСтрока.Количество;
		НоваяСтрока.Претензия = строка.Претензия; 
		//СтавкаНДС = СтавкаНДСПартииЧисло(строка.Партия,ТекущаяДата(),0);
		//НоваяСтрока.СуммаНДС = НоваяСтрока.Сумма*СтавкаНДС/(100+СтавкаНДС);
	КонецЦикла; 	
КонецПроцедуры
