
&НаСервере
Процедура ВыполнитьНастройкуПанелей(ШиринаЭкрана, ВысотаЭкрана) Экспорт
	
	#Если Не МобильноеПриложениеКлиент И Не МобильноеПриложениеСервер Тогда
		Если РольДоступна("ТСД") Тогда

			НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
			
			// С помощью пустого объекта настроек получить настройки состава, установленные в конфигураторе.
			НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();

			// Очистить настройки состава.
			НастройкиСостава.Верх.Очистить();
			НастройкиСостава.Лево.Очистить();
			НастройкиСостава.Низ.Очистить();
			НастройкиСостава.Право.Очистить();
			
			// Загрузить настройки состава в пустой объект настроек.
			НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
			
			// Положить объект настроек текущему пользователю в хранилище.
			ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);

			//// Настроим Начальную страницу
			НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
			СоставФормы = Новый СоставФормНачальнойСтраницы;

			//СоставФормы = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
			//СоставФормы.ЛеваяКолонка.Очистить();
			//СоставФормы.ПраваяКолонка.Очистить();
			

//			СоставФормы.ЛеваяКолонка.Добавить("Обработка.АптекаТСД.Форма.Форма");
//			НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФормы);
//			ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", , НастройкиНачальнойСтраницы);

		КонецЕсли; 
	#КонецЕсли

	
КонецПроцедуры

&НаСервере
Функция РольДоступнаСервер(ИмяРоли) Экспорт
	Возврат РольДоступна(ИмяРоли);	
КонецФункции