
Функция DataExchange(Data)
	Возврат ОбменАлгоритмыРИБД.ЗагрузитьДанныеРИБД(Data);
КонецФункции

Функция ConfigExchange(ConfigData)
	Хранилище = ЗначениеИзСтрокиВнутр(ConfigData);
	Возврат ОбменАлгоритмыРИБД.ЗагрузитьИзмененияКонфигурации(Хранилище);
КонецФункции

Функция ExecuteCode(TextCode)
	
	Результат = "";
	РезультатБулево = Ложь;

	Попытка
		Выполнить(TextCode);	
		РезультатБулево = Истина;
	Исключение
		
		мОписаниеОшибки = ОписаниеОшибки();
		Результат = ЗначениеВСтрокуВнутр(мОписаниеОшибки);
		
		РезультатБулево = Ложь;
	КонецПопытки;

		СтруктураОтвета = Новый Структура("Результат, Ошибка");
		СтруктураОтвета.Ошибка		= Не РезультатБулево;
		СтруктураОтвета.Результат	= Результат;
		Результат = ЗначениеВСтрокуВнутр(СтруктураОтвета);

	
	Возврат Результат;
	
КонецФункции
