Функция ПолучитьСуммуДокументаЗаказ(Ссылка) Экспорт
	
	СтруктураСуммЗаказа = Новый Структура("СуммаЗаказа,СуммаДоставки",0,0);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЗаказТовар.Ссылка.СуммаДоставки) КАК СуммаДоставки,
	|	СУММА(ЗаказТовар.Сумма) КАК СуммаЗаказа
	|ИЗ
	|	Документ.Заказ.Товар КАК ЗаказТовар
	|ГДЕ
	|	ЗаказТовар.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		ЗаполнитьЗначенияСвойств(СтруктураСуммЗаказа,Выборка);
	КонецЦикла;
	
	Возврат СтруктураСуммЗаказа;
	
КонецФункции
