Функция СоздатьЛог(ВидЛог,ДатаНачала,Наименование,ВходящиеДанные = "") Экспорт
	
	Лог = Справочники.Логи.СоздатьЭлемент();
	Лог.БазаДанных = ПараметрыСеанса.ТекущийАдресХранения;
	Лог.ВидЛога = ВидЛог;
	Лог.ДатаНачала = ДатаНачала;
	Лог.Наименование = Наименование;
	Лог.ВходящиеДанные = ВходящиеДанные;
	Лог.РезультатВыполнения = Перечисления.ВидРезультатаВыполнения.НеЗавершено;
	Лог.Записать();
	
	Возврат Лог.Ссылка
	
КонецФункции

Процедура ЗаписатьИзмененияВЛог(ЛогСсылка,Сообщение,Завершение = неопределено) Экспорт
	Лог = ЛогСсылка.ПолучитьОбъект();
	Лог.РезультатВыполненияПодробно = Лог.РезультатВыполненияПодробно + Символы.ПС;
	Лог.РезультатВыполненияПодробно = Лог.РезультатВыполненияПодробно + Формат(ТекущаяДата(),"") + Символы.ПС;
	Лог.РезультатВыполненияПодробно = Лог.РезультатВыполненияПодробно + Сообщение;
	
	МассивСообщений = ПолучитьСообщенияПользователю(Истина);
	
	Если МассивСообщений.Количество() > 0 тогда
		Лог.РезультатВыполненияПодробно = Лог.РезультатВыполненияПодробно + Символы.ПС+"Накопленные сообщения:";		
	КонецЕсли;
	
	Для каждого Сообщение из МассивСообщений цикл
		Лог.РезультатВыполненияПодробно = Лог.РезультатВыполненияПодробно + Символы.ПС + Сообщение.текст;
	КонецЦикла;
	
	Лог.РезультатВыполнения = Перечисления.ВидРезультатаВыполнения.НеЗавершено;
	
	Если Завершение = Истина тогда
		Лог.РезультатВыполнения = Перечисления.ВидРезультатаВыполнения.УспешноЗавершено;
	ИначеЕсли Завершение = Ложь тогда
		Лог.РезультатВыполнения = Перечисления.ВидРезультатаВыполнения.ЗавершеноСОшибками;
	КонецЕсли;
	
	Если Завершение <> неопределено тогда
		Лог.ДатаЗавершения = ТекущаяДата();
	КонецЕсли;
	
	Лог.Записать();
	
КонецПроцедуры