
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если не ЗначениеЗаполнено(Отдел) Тогда
		Сообщить("Отдел не выбран!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Отдел.Код = "11" Тогда
		Сообщить("Отдел переоценки и переввода! Нельзя!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для каждого строка из Товары цикл
		Если Строка.Количество = 0 Тогда 
			Продолжить 
		КонецЕсли;
		Движение = Движения.Претензии.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Партия=строка.Партия;
		Движение.Претензия=строка.Претензия;
		Движение.Склад=Отдел;  
		Движение.ДокументПретензии=Ссылка;
		Движение.Количество=строка.Количество; 
		Движение.Сумма=строка.Сумма;
	КонецЦикла;
	Движения.Претензии.Записывать = Истина;
	Сообщить("Документ " + Строка(Ссылка) + " проведен!!!");
	
КонецПроцедуры
