
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустой() Тогда
		Запись.КлючСвязи = Новый УникальныйИдентификатор;
	КонецЕсли;

	УсловияПоставки.Отбор.Элементы.Очистить();
    ЭлементОтбора = УсловияПоставки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КлючСвязи");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Запись.КлючСвязи;

	ПолучитьСуммуЛимитаЗаказа();

КонецПроцедуры


&НаСервере
Процедура ПолучитьСуммуЛимитаЗаказа()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛимитыПоставки.Сумма
		|ИЗ
		|	РегистрСведений.ЛимитыПоставки КАК ЛимитыПоставки
		|ГДЕ
		|	ЛимитыПоставки.Поставщик = &Поставщик
		|	И ЛимитыПоставки.Склад = &Склад
		|	И ЛимитыПоставки.ТипПоставки = &ТипПоставки";
	
	Запрос.УстановитьПараметр("Поставщик", Запись.Поставщик);
	Запрос.УстановитьПараметр("Склад", Запись.МестоХранения);
	Запрос.УстановитьПараметр("ТипПоставки", Запись.ТипПоставки);

	фМинСуммаЗаказа = 0;
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		фМинСуммаЗаказа = ВыборкаДетальныеЗаписи.Сумма;
		Возврат;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	ПолучитьСуммуЛимитаЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура ТипПоставкиПриИзменении(Элемент)
	ПолучитьСуммуЛимитаЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	ПолучитьСуммуЛимитаЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если ПустаяСтрока(Запись.КлючСвязи) Тогда

		Запись.КлючСвязи = Новый УникальныйИдентификатор;
		
		УсловияПоставки.Отбор.Элементы.Очистить();
	    ЭлементОтбора = УсловияПоставки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КлючСвязи");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = Запись.КлючСвязи;

	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура УсловияПоставкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Параметры.Ключ.Пустой() ИЛИ ПустаяСтрока(Запись.КлючСвязи) Тогда
		ПоказатьПредупреждение(, "Сохраните текущую настройку", 20);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДанныеВладельца = Новый Структура;
	ДанныеВладельца.Вставить("Поставщик", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Поставщик, "Наименование"));
	
	Параметр = Новый Структура("ДанныеВладельца", ДанныеВладельца);

КонецПроцедуры

