
Функция ПодключениеКСерверуSQL(Сервер,БазаДанных,Логин,Пароль) Экспорт
	Соединение = Новый COMОбъект("ADODB.Connection");
	Соединение.ConnectionTimeOut	= 30;
	Соединение.CommandTimeOut	= 100; 
	Соединение.connectionString = "SERVER="+Сервер+"; Database="+БазаДанных+"; DRIVER=SQL Server; UID="+Логин+"; PWD="+Пароль+";LANGUAGE=русский;Trusted_Connection=NO";
	Соединение.Open();   
	Если Соединение.State()=0 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось соединиться с сервером";
		СообщениеПользователю.Сообщить();
		Соединение.Сlose();
		Соединение = Неопределено;
	КонецЕсли;	
	Возврат Соединение;
КонецФункции

Функция ПодключениеКСерверуSQLПоНастройке(Настройка) Экспорт
	Если НЕ ЗначениеЗаполнено(Настройка) или ТипЗнч(Настройка) <> Тип("СправочникСсылка.НастройкиПодключения") Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не заполнена настройка подключения!";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено
	КонецЕсли;
	Возврат ПодключениеКСерверуSQL(Настройка.Сервер,Настройка.БазаДанных,Настройка.Логин,Настройка.Пароль);
КонецФункции

Функция ВыполнитьЗапросSQL(ТекстЗапроса,Соединение = Неопределено,НастройкаПодключения = Неопределено,ПреобразоватьВТЗ=Ложь,ОписаниеОшибки=Неопределено,КоличествоПопыток = 1, Интервал = 0,ТаблицаТипизированная = неопределено) Экспорт
	Если Соединение = Неопределено тогда
		Соединение = ПодключениеКСерверуSQLПоНастройке(НастройкаПодключения);
		Если Соединение = Неопределено тогда
			Возврат Неопределено
		КонецЕсли;
	КонецЕсли;
	RecSet = Новый COMОбъект("ADODB.RecordSet"); 
	RecZapr = Новый COMОбъект("ADODB.Command");
	RecZapr.ActiveConnection=Соединение;
	RecZapr.CommandTEXT = ТекстЗапроса;
	RecZapr.CommandType = 1;    
	RecZapr.CommandTimeout=60;
	Для ит = 0 по КоличествоПопыток цикл
		Если ит > 0 тогда
			ДатаЗавершения = ТекущаяДата()+Интервал;
			Пока ТекущаяДата() < ДатаЗавершения цикл
				
			КонецЦикла;
		КонецЕсли;
		Попытка
			RecSet = RecZapr.Execute();
			Если ПреобразоватьВТЗ тогда
				Возврат ПреобразоватьRecordSetВТЗ(RecSet,ТаблицаТипизированная);
			Иначе
				Возврат RecSet;
			КонецЕсли
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			Соединение.Close();
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не удалось выполнить SQL запрос по причине:"+Символы.ПС+ОписаниеОшибки;
			СообщениеПользователю.Сообщить();
			Если ит = КоличествоПопыток тогда
				Возврат Неопределено
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;
КонецФункции

Функция ПреобразоватьRecordSetВТЗ(RecordSet,ТаблицаТипизированная = Неопределено)
	Если ТаблицаТипизированная = неопределено тогда
	ТаблицаРезультат = Новый ТаблицаЗначений;
	Для Каждого Колонка из RecordSet.Fields Цикл
		Если Колонка.Name = "ID_77" тогда
			ТаблицаРезультат.Колонки.Добавить(Колонка.Name,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(9,ДопустимаяДлина.Фиксированная)));
		Иначе
			ТаблицаРезультат.Колонки.Добавить(Колонка.Name);
		КонецЕсли;
	КонецЦикла;   
	Иначе
		ТаблицаРезультат = ТаблицаТипизированная;
	КонецЕсли;
	Пока RecordSet.EOF() = 0 Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		Для каждого Колонка из RecordSet.Fields Цикл 
			Значение = Колонка.Value;
			Если ТипЗнч(Значение) = Тип("Строка") тогда
				Значение = СтрЗаменить(Значение,Символы.НПП,"");
				Если ТаблицаРезультат.Колонки[Колонка.Name].ТипЗначения.КвалификаторыСтроки.ДопустимаяДлина = ДопустимаяДлина.Переменная 
					и ТаблицаРезультат.Колонки[Колонка.Name].ТипЗначения.КвалификаторыСтроки.Длина <> 0 тогда
					Значение = СокрЛП(Значение);
				КонецЕсли;
			ИначеЕсли ТипЗнч(Значение) = Тип("Число") и ТаблицаРезультат.Колонки[Колонка.Name].ТипЗначения.СодержитТип(Тип("Строка"))  тогда
             	Значение = Формат(Значение,"ЧГ=");
			КонецЕсли;				
			НоваяСтрока[Колонка.Name] = Значение;
		КонецЦикла;
		RecordSet.MoveNext()
	КонецЦикла;        
	Возврат ТаблицаРезультат
КонецФункции

Функция СформироватьУсловияДляIN(Массив,Порция = 0) Экспорт
	
	Если Порция <= 0 тогда
		
		СтрокаУсловие = "";		
		Для каждого Строка из Массив цикл
			СтрокаУсловие = СтрокаУсловие+"'"+Строка+"'"+",";
		КонецЦикла;		
		СтрокаУсловие = "("+Лев(СтрокаУсловие,СтрДлина(СтрокаУсловие)-1)+")";
		
		Возврат СтрокаУсловие;
		
	Иначе
		
		МассивУсловий = Новый Массив;
		СтрокаУсловие = "";
		ит = 1;
		
		Для каждого Строка из Массив цикл			
			СтрокаУсловие = СтрокаУсловие+"'"+Строка+"'"+",";			
			Если ит = порция тогда				
				МассивУсловий.Добавить("("+Лев(СтрокаУсловие,СтрДлина(СтрокаУсловие)-1)+")");
				СтрокаУсловие = "";				
			КонецЕсли;			
			ит = ит + 1;			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СтрокаУсловие) тогда
			МассивУсловий.Добавить("("+Лев(СтрокаУсловие,СтрДлина(СтрокаУсловие)-1)+")");
		КонецЕсли;
		
		Возврат МассивУсловий;
		
	КонецЕсли;
	
КонецФункции