
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// НастройкиПрайсаПоставщика.Параметры.УстановитьЗначениеПараметра("Поставщик", Объект.Ссылка);
	//МестаХранения.Параметры.УстановитьЗначениеПараметра("Поставщик", Объект.Владелец);
	//МестаХранения.Параметры.УстановитьЗначениеПараметра("Договор", Объект.Ссылка);

	МестаХранения.Отбор.Элементы.Очистить();
    ЭлементОтбора = МестаХранения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Объект.Владелец;
	
    ЭлементОтбора = МестаХранения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Договор");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;


	
	КоррекцияПрайса.Отбор.Элементы.Очистить();
    ЭлементОтбора = КоррекцияПрайса.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Объект.Владелец;

    ЭлементОтбора = КоррекцияПрайса.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Договор");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;

	
	ДозаказДоУпаковки.Отбор.Элементы.Очистить();
    ЭлементОтбора = ДозаказДоУпаковки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Объект.Владелец;

    ЭлементОтбора = ДозаказДоУпаковки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Договор");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;

	НастройкаВидимостиЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура МестаХраненияПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиМестаХранения", 0.001, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиМестаХранения()

	Элементы.ДозаказДоУпаковки.Доступность = Истина;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ДозаказДоУпаковки.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Элементы.МестаХранения.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДозаказДоУпаковки.Отбор.Элементы.Очистить();
    ЭлементОтбора = ДозаказДоУпаковки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Объект.Владелец;

    ЭлементОтбора = ДозаказДоУпаковки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Договор");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;

    ЭлементОтбора = ДозаказДоУпаковки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МестоХранения");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Элементы.МестаХранения.ТекущиеДанные.МестоХранения;

    ЭлементОтбора = ДозаказДоУпаковки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПрайса");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Элементы.МестаХранения.ТекущиеДанные.ТипПрайса;

    ЭлементОтбора = ДозаказДоУпаковки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПоставки");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = Элементы.МестаХранения.ТекущиеДанные.ТипПоставки;

КонецПроцедуры

&НаКлиенте
Процедура ДозаказДоУпаковкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.МестаХранения.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	НастройкаВидимостиЭлементовФормы();

КонецПроцедуры

&НаСервере
Процедура НастройкаВидимостиЭлементовФормы()

	Если Объект.ВидДоговора = 0 Тогда
		Элементы.ГруппаПоставщик.Видимость = Ложь;
		Элементы.ГруппаПокупатель.Видимость = Истина;

	ИначеЕсли Объект.ВидДоговора = 1 Тогда
		Элементы.ГруппаПоставщик.Видимость = Истина;
		Элементы.ГруппаПокупатель.Видимость = Ложь;

	Иначе
		Элементы.ГруппаПоставщик.Видимость = Ложь;
		Элементы.ГруппаПокупатель.Видимость = Ложь;

	КонецЕсли; 

КонецПроцедуры
