
&НаСервереБезКонтекста
Функция ПроверитьНаСервере(КодФормирования)
	
	СтруктураПараметров = Неопределено;	
	Попытка
		Выполнить(КодФормирования);
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	Если СтруктураПараметров <> Неопределено и ТипЗнч(СтруктураПараметров) <> Тип("Структура") тогда
		Возврат "Переменная СтруктураПараметров должна быть неопределено или иметь тип Структура";
	КонецЕсли;
	Возврат Истина;
КонецФункции


&НаКлиенте
Процедура ВложенияТабличныеДокументыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекущиеДанные = Элементы.ВложенияТабличныеДокументы.ТекущиеДанные;
	Если ОтменаРедактирования или ТекущиеДанные <> неопределено тогда
		Возврат;
	КонецЕсли;
	Если НоваяСтрока и не ЗначениеЗаполнено(ТекущиеДанные.КодФормированияПараметраЗапросов) тогда
		Элементы.ВложенияТабличныеДокументы.ТекущиеДанные.КодФормированияПараметраЗапросов = "СтруктураПараметров = неопределено;";	
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.КодФормированияПараметраЗапросов) тогда
		РезультатПроверки = ПроверитьНаСервере(ТекущиеДанные.КодФормированияПараметраЗапросов);
		Если ТипЗнч(РезультатПроверки) = Тип("Строка") тогда
			Сообщить(РезультатПроверки);
			Отказ = Истина;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры



