
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиТовара.Очистить();
	
	ЭтоСамовывоз = Ложь; //Грачев
	// Захар 13-11-2017 {
	//Отдел = ДокументОснование.Отдел;
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Приходная") Тогда
		Отдел = ДокументОснование.Отдел;
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Если ДокументОснование.ТипПрихода = Перечисления.ТипПрихода.СамовывозПакеты
				ИЛИ ДокументОснование.ТипПрихода = Перечисления.ТипПрихода.СамовывозКоробки
				Тогда 
				ЭтоСамовывоз = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Перемещение") Тогда
		Отдел = ДокументОснование.Получатель;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// } Захар
	Для Каждого Строка из ПринятыйТовар Цикл
		Движение = Движения.ОстаткиТовара.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Товар = Строка.Товар;
		Движение.Отдел = Отдел;
		Движение.Партия = Строка.Партия;
		Если ЭтоСамовывоз Тогда    //Грачев
			Движение.Резерв = Строка.Количество;		
		Иначе
			Движение.Остаток = Строка.Количество;		
		КонецЕсли;
	КонецЦикла;
	Движения.ОстаткиТовара.Записывать = Истина;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Приемка_ТоварыВРаботе.Период,
	|	Приемка_ТоварыВРаботе.Документ,
	|	Приемка_ТоварыВРаботе.Товар,
	|	Приемка_ТоварыВРаботе.Партия
	|ИЗ
	|	РегистрСведений.Приемка_ТоварыВРаботе КАК Приемка_ТоварыВРаботе
	|ГДЕ
	|	Приемка_ТоварыВРаботе.ПриемныйОрдер = &ПриемныйОрдер";
	Запрос.УстановитьПараметр("ПриемныйОрдер",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		МенеджерЗаписи = РегистрыСведений.Приемка_ТоварыВРаботе.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ПриемныйОрдер = Документы.ПриемныйОрдер.ПустаяСсылка();
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

