
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоТовара = Параметры.Количество;
	Если Параметры.Свойство("МаксКоличество") Тогда
		МаксКоличество = Параметры.МаксКоличество;
	Иначе
		МаксКоличество = 0;
	КонецЕсли;
	Если МаксКоличество > 0 Тогда
		Элементы.КоличествоТовара.МаксимальноеЗначение = МаксКоличество;
		Элементы.КомандаКолво2.Доступность = (МаксКоличество > 1);
		Элементы.КомандаКолво3.Доступность = (МаксКоличество > 2);
		Элементы.КомандаКолво4.Доступность = (МаксКоличество > 3);
		Элементы.КомандаКолво5.Доступность = (МаксКоличество > 4);
		Элементы.КомандаКолво6.Доступность = (МаксКоличество > 5);
		Элементы.КомандаКолво7.Доступность = (МаксКоличество > 6);
		Элементы.КомандаКолво8.Доступность = (МаксКоличество > 7);
		Элементы.КомандаКолво9.Доступность = (МаксКоличество > 8);
		Элементы.КомандаКолво10.Доступность = (МаксКоличество > 9);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердить(Команда)
	Если МаксКоличество <= 0 Тогда
	ИначеЕсли КоличествоТовара > МаксКоличество Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя заказать больше " + МаксКоличество + ".";
		Сообщение.Поле = "КоличествоТовара";
		Сообщение.УстановитьДанные(Элементы.КоличествоТовара);
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	ДопПараметры = Новый Структура( "Количество", КоличествоТовара );
	ЭтаФорма.Закрыть( ДопПараметры );
КонецПроцедуры

&НаКлиенте
Процедура КомандаКолво1(Команда)
	КоличествоТовара = 1;
	КомандаПодтвердить(Команда);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКолво2(Команда)
	КоличествоТовара = 2;
	КомандаПодтвердить(Команда);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКолво3(Команда)
	КоличествоТовара = 3;
	КомандаПодтвердить(Команда);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКолво4(Команда)
	КоличествоТовара = 4;
	КомандаПодтвердить(Команда);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКолво5(Команда)
	КоличествоТовара = 5;
	КомандаПодтвердить(Команда);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКолво6(Команда)
	КоличествоТовара = 6;
	КомандаПодтвердить(Команда);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКолво7(Команда)
	КоличествоТовара = 7;
	КомандаПодтвердить(Команда);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКолво8(Команда)
	КоличествоТовара = 8;
	КомандаПодтвердить(Команда);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКолво9(Команда)
	КоличествоТовара = 9;
	КомандаПодтвердить(Команда);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКолво10(Команда)
	КоличествоТовара = 10;
	КомандаПодтвердить(Команда);
КонецПроцедуры
