
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ Параметры.Свойство("Отбор") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

//	СписокНастроек.Параметры.УстановитьЗначениеПараметра("Поставщик", Параметры.Отбор.Поставщик);

	фПоставщик = Параметры.Отбор.Поставщик;

	ЭлементОтбора = СписокНастроек.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Параметры.Отбор.Поставщик;
	
КонецПроцедуры
