
&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария( Элемент.ТекстРедактирования, ЭтаФорма, "Объект.Комментарий" );
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборСпискаНастройкиУсловийРегистрацииПоТекущемуЭлементу();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОтборСпискаНастройкиУсловийРегистрацииПоТекущемуЭлементу();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаНастройкиУсловийРегистрацииПоТекущемуЭлементу()
	
	ЭлементыОтбора = ЭтаФорма.НастройкиУсловийРегистрации.Отбор.Элементы;
	Отбор = Неопределено;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных( "ОбъектРезультатСвязи" ) И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			Отбор = ЭлементОтбора;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
	Если Отбор = Неопределено Тогда
		
		Отбор = ЭлементыОтбора.Добавить( Тип( "ЭлементОтбораКомпоновкиДанных" ) );
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных( "ОбъектРезультатСвязи" );
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Отбор.Использование = Истина;
	Отбор.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры