
&НаСервере
Процедура ЗаполнитьДокументыНаСервере()
	
	ЗаполнитьЗначенияСвойств(Объект,Период);
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект",Тип("ОбработкаОбъект.ЗагрузкаПриходов"));
	ЗначениеОбъект.ЗаполнитьТаблицуНакладные();
	ЗначениеВРеквизитФормы(ЗначениеОбъект,"Объект");
	//---%%% Тарасков - 24.10.2017 - Начало
	//Для каждого строка из Объект.Накладные цикл
	//	Строка.Загружать = Истина;
	//КонецЦикла;
	//---%%% Тарасков - 24.10.2017 - Конец
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументы(Команда)
	ЗаполнитьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаНачала = ТекущаяДата();
	Объект.ДатаОкончания = ТекущаяДата();
	ЗаполнитьЗначенияСвойств(Период,Объект);
	//---%%% Тарасков - 19.10.2017 - Начало
	Объект.ЗагружатьНезависимоОтПризнакаАктивности = Ложь;
	//---%%% Тарасков - 19.10.2017 - Конец
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументыНаСервере()
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект",Тип("ОбработкаОбъект.ЗагрузкаПриходов"));
	ЗначениеОбъект.ЗагрузитьДокументы();
	ЗначениеВРеквизитФормы(ЗначениеОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокументы(Команда)
	ЗагрузитьДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкиВыполнить(Отметка)
	Для каждого строка из Объект.Накладные цикл
		Строка.Загружать = Отметка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	УстановитьОтметкиВыполнить(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	УстановитьОтметкиВыполнить(Ложь);
КонецПроцедуры


