

&НаКлиенте
Процедура НазваниеСервисаПриИзменении(Элемент)
	Объект.Наименование = Объект.НазваниеСервиса; 
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	Объект.Наименование = Объект.НазваниеСервиса; 
КонецПроцедуры

&НаСервере
Функция ПроверитьПодключениеНаСервере()
	
	ТекстОшибки = "";
	Подключение = ОбщийМодульВебСервисы.ПодключитьсяКВебСервису(Объект.Ссылка,ТекстОшибки);
	Если Подключение=Неопределено Тогда
		Возврат ТекстОшибки;
	Иначе
		Возврат "Подключение выполнено";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	Сообщить(ПроверитьПодключениеНаСервере());
КонецПроцедуры



